/**
 * 原作者QQ: 1438667453 楠桃
 * 本软件使用EasyClick iOS免越狱 USB版本开发，适配 v4.1中控台版本
 * 文档地址：https://ieasyclick.com/iosdocs/
 * EasyClick iOS免越狱 USB专业用于开发iOS自动化脚本、iOS免越狱投屏等的软件平台
 * EasyClick iOS免越狱还支持无需任何硬件直接打包ipa的自动化脚本方案
 * 官方地址：https://ieasyclick.com
 * QQ交流群： 
 * Q群1: 777164022 Q群2: 922739785 Q群3：647082990
 * Q群4: 772810035 Q群5: 484379843 Q群6：435253761
 */


function Csh_function() {

}
var csh = new Csh_function();

var x =626
    var y = 0
        var x1 = 734
            var y1 = 252


//直接寻路
Csh_function.prototype.药店伙计=function() {
    let iooi = 0;
    let a = gjfz.dzbs( "#F2F3F5-#101010", "2|-2|#FFFEFF-#101010,4|8|#B2BABC-#101010,1|56|#6E797D-#101010,22|17|#304347-#101010,13|54|#2F4246-#101010,-22|28|#304347-#101010,32|-37|#304347-#101010,21|69|#304347-#101010,3|-76|#304347-#101010,-2|-12|#304347-#101010,-7|-40|#304347-#101010,16|33|#2F4246-#101010,-28|28|#304347-#101010,-24|73|#304347-#101010,14|-30|#304347-#101010,-6|60|#4F6165-#101010,6|74|#F8F8F8-#101010,-5|33|#304347-#101010,20|86|#304347-#101010",286,666,706,1109)
    if (a===false){
        clickPoint(466,1188)
        sleep(300);
        gjfz.dzbs( "#F2F3F5-#101010", "2|-2|#FFFEFF-#101010,4|8|#B2BABC-#101010,1|56|#6E797D-#101010,22|17|#304347-#101010,13|54|#2F4246-#101010,-22|28|#304347-#101010,32|-37|#304347-#101010,21|69|#304347-#101010,3|-76|#304347-#101010,-2|-12|#304347-#101010,-7|-40|#304347-#101010,16|33|#2F4246-#101010,-28|28|#304347-#101010,-24|73|#304347-#101010,14|-30|#304347-#101010,-6|60|#4F6165-#101010,6|74|#F8F8F8-#101010,-5|33|#304347-#101010,20|86|#304347-#101010",286,666,706,1109)
    }
    while (true) {
        let ydhj1 = gjfz.透明找图("药店伙计坐标","药店伙计坐标",x,y,x1,y1,0,0.7)
        if (ydhj1) {
           sleep("300")
            clickPoint(413,667)
            break;
        }else {
            iooi++;
            if (iooi===5){
                clickPoint(512,1172)
                sleep("500")
                clickPoint(580,904)
            }
            if (iooi===200){
                return;
            }

        }
    }

    let ixx = 0 ;
    while (true) {
        let 白色旗 = ocrjq.烹饪()
        if (白色旗) {
            break;
        } else {
            ixx++;
            let 重叠判断 = gjfz.透明找图("请选择一个角色","请选择一个角色",22,507,582,1097,0,0.7)
            if (重叠判断) {
                logd("请选择要做的事");
                sleep("100")
                gjfz.dzbs( "#FFFFFF-#101010", "-6|0|#FFFFFF-#101010,6|-33|#FBFBFB-#101010,-4|-36|#FFFFFF-#101010,-9|-38|#FEFFFF-#101010,-14|-35|#F4F5F9-#101010,-6|-18|#FEFEFE-#101010,20|-92|#385867-#101010,-26|-98|#305067-#101010,-31|116|#30505F-#101010,33|117|#385867-#101010,0|59|#FFFFFF-#101010,-14|49|#FEFEFE-#101010,-6|30|#FFFFFD-#101010,-3|5|#365569-#101010,3|5|#39556A-#101010,8|-1|#F7F8FA-#101010,1|-27|#FFFEFC-#101010,6|-24|#FEFEFF-#101010,0|-6|#365569-#101010,-12|30|#305568-#101010,-32|-21|#30505F-#101010,-9|-27|#305366-#101010,1|0|#FFFFFF-#101010,3|0|#FFFFFF-#101010,-6|-1|#FFFFFF-#101010,-6|9|#FFFDFE-#101010")
                sleep("500")
            }else {
                if (ixx===3){
                    clickPoint(413,667)
                }
            }
            if (ixx === 5){
                sleep("200")
                clickPoint(463,1190)
                sleep("500")
                clickPoint(596,900)
                sleep("3000")
                clickPoint(413,667)
                sleep("500")
            }
            if (ixx===8){
                return;
            }
        }
    }


    let iix = 0 ;
    while (true) {
        let 给予界面 =  gjfz.透明找图("给予确定", "给予确定", 6,223,141,571, 1, 0.7)
        if (给予界面) {
            return;
        } else {
            sleep("500")
            iix++;
            if (iix===3){
                clickPoint(413,667)
                sleep("800")
                let 白色旗 = gjfz.透明找图("请选择要做的事", "请选择要做的事", 3, 853, 746, 1326, 0, 0.8)
                if (白色旗) {
                   ocrjq.烹饪()
                    sleep("500")
                    gjfz.透明找图("给予确定", "给予确定", 6,223,141,571, 1, 0.7)
                    return;
                }
            }
            if (iix === 5) {
                sleep("500")
                clickPoint(463,1190)
                sleep("500")
                clickPoint(596,900)
                sleep("3000")
                clickPoint(413,667)
                sleep("500")
                let 白色旗 = gjfz.透明找图("请选择要做的事", "请选择要做的事", 3, 853, 746, 1326, 0, 0.8)
                if (白色旗) {
                   ocrjq.烹饪()
                    sleep("500")
                    gjfz.透明找图("给予确定", "给予确定", 6,223,141,571, 1, 0.7)
                    return;
                }
            }
            if (iix===8){
                return;
            }
        }
    }
}
//a1
Csh_function.prototype.紫阳药师=function() {
let iooi = 0
    let a = gjfz.dzbs( "#FEFFFF-#101010","1|27|#E5E6E8-#101010,-12|-25|#304347-#101010,-10|-28|#304347-#101010,-3|-50|#304347-#101010,-28|31|#304347-#101010,-23|4|#304347-#101010,1|62|#FAFAFA-#101010,-6|66|#314347-#101010,14|-21|#304347-#101010,2|34|#B5BDBF-#101010,-24|-53|#304347-#101010,29|-1|#304347-#101010,12|37|#9EA8AA-#101010,-10|-15|#304347-#101010,19|-38|#304347-#101010,14|-30|#304347-#101010,-10|25|#314546-#101010,-30|7|#304347-#101010,22|-39|#304347-#101010",286,666,706,1109)
   if (a===false){
       clickPoint(466,1188)
       sleep(300);
       gjfz.dzbs( "#FEFFFF-#101010","1|27|#E5E6E8-#101010,-12|-25|#304347-#101010,-10|-28|#304347-#101010,-3|-50|#304347-#101010,-28|31|#304347-#101010,-23|4|#304347-#101010,1|62|#FAFAFA-#101010,-6|66|#314347-#101010,14|-21|#304347-#101010,2|34|#B5BDBF-#101010,-24|-53|#304347-#101010,29|-1|#304347-#101010,12|37|#9EA8AA-#101010,-10|-15|#304347-#101010,19|-38|#304347-#101010,14|-30|#304347-#101010,-10|25|#314546-#101010,-30|7|#304347-#101010,22|-39|#304347-#101010",286,666,706,1109)
   }
    while (true) {
        let zyys = gjfz.透明找图("紫阳药师坐标","紫阳药师坐标",x,y,x1,y1,0,0.7)
        if (zyys) {
            sleep("500")
            clickPoint(413,667)
            break;
        }else {
            iooi++
            if (iooi===260){
                return;
            }
        }}
    sleep("200")
    let ixx = 0 ;
    while (true) {
        let 白色旗 = ocrjq.烹饪()
        if (白色旗) {
            break;
        } else {
            ixx++;
            let 重叠判断 = gjfz.透明找图("请选择一个角色","请选择一个角色",22,507,582,1097,0,0.7)
            if (重叠判断) {
                logd("请选择要做的事");
                sleep("100")
                gjfz.dzbs( "#FFFFFF-#101010", "-3|2|#315669-#101010,3|2|#385469-#101010,-9|7|#406376-#101010,-3|7|#325569-#101010,8|7|#3A556A-#101010,0|10|#EBEFF2-#101010,-11|20|#EEF2F3-#101010,-3|20|#F5F9FC-#101010,30|-107|#376272-#101010,-32|-109|#30505F-#101010,-47|87|#10171F-#101010,12|86|#385469-#101010,7|59|#FFFEFF-#101010,-1|59|#FEFEFE-#101010,-2|53|#FDFEFF-#101010,-2|49|#FCFCFA-#101010,-1|44|#FCFCFC-#101010,-1|38|#FEFEFE-#101010,-4|31|#FEFEFF-#101010,-5|19|#FFFFFF-#101010,0|5|#ECF0F3-#101010,2|-7|#F9F9F9-#101010,0|-12|#DDE0E5-#101010,-5|-20|#FFFFFF-#101010,4|-34|#FFFFFF-#101010,-12|33|#FDFFFE-#101010,10|32|#FFFFFF-#101010,-2|49|#FCFCFA-#101010,-2|62|#315468-#101010")
                sleep("500")
            }else {
                if (ixx===3){
                    clickPoint(413,667)
                }
            }
            if (ixx === 5){
                sleep("200")
                clickPoint(463,1190)
                sleep("500")
                clickPoint(596,900)
                sleep("3000")
                clickPoint(413,667)
                sleep("500")
            }
            if (ixx===8){
                return;
            }
        }
    }


    let iix = 0 ;
    while (true) {
        let 给予界面 =  gjfz.透明找图("给予确定", "给予确定", 6,223,141,571, 1, 0.7)
        if (给予界面) {
            return;
        } else {
            sleep("500")
            iix++;
            if (iix===3){
                clickPoint(413,667)
                sleep("800")
                let 白色旗 = gjfz.透明找图("请选择要做的事", "请选择要做的事", 3, 853, 746, 1326, 0, 0.8)
                if (白色旗) {
                   ocrjq.烹饪()
                    sleep("500")
                    gjfz.透明找图("给予确定", "给予确定", 6,223,141,571, 1, 0.7)
                    return;
                }
            }
            if (iix === 5) {
                sleep("500")
                clickPoint(463,1190)
                sleep("500")
                clickPoint(596,900)
                sleep("3000")
                clickPoint(413,667)
                sleep("500")
                let 白色旗 = gjfz.透明找图("请选择要做的事", "请选择要做的事", 3, 853, 746, 1326, 0, 0.8)
                if (白色旗) {
                   ocrjq.烹饪()
                    sleep("500")
                    gjfz.透明找图("给予确定", "给予确定", 6,223,141,571, 1, 0.7)
                    return;
                }
            }
            if (iix===8){
                return;
            }
        }
    }

}
//b1
Csh_function.prototype.朱紫校尉=function() {
    let iooi = 0;
    let a = gjfz.dzbs("#F6F4F5-#101010","4|27|#36494D-#101010,-17|91|#304347-#101010,25|-21|#304347-#101010,-12|89|#304347-#101010,22|-54|#304347-#101010,-24|88|#304347-#101010,-12|-34|#304347-#101010,21|65|#304347-#101010,13|24|#2F4246-#101010,-23|-26|#304347-#101010,-7|-46|#304347-#101010,17|16|#304347-#101010,25|-18|#304347-#101010,21|4|#304347-#101010,-2|27|#F9FAFC-#101010,13|-62|#304347-#101010,5|51|#939CA1-#101010,15|4|#304347-#101010,-27|-14|#304347-#101010",286,666,706,1109)
    if (a===false){
        clickPoint(466,1188)
        sleep(300);
        gjfz.dzbs("#F6F4F5-#101010","4|27|#36494D-#101010,-17|91|#304347-#101010,25|-21|#304347-#101010,-12|89|#304347-#101010,22|-54|#304347-#101010,-24|88|#304347-#101010,-12|-34|#304347-#101010,21|65|#304347-#101010,13|24|#2F4246-#101010,-23|-26|#304347-#101010,-7|-46|#304347-#101010,17|16|#304347-#101010,25|-18|#304347-#101010,21|4|#304347-#101010,-2|27|#F9FAFC-#101010,13|-62|#304347-#101010,5|51|#939CA1-#101010,15|4|#304347-#101010,-27|-14|#304347-#101010",286,666,706,1109)
    }
    while (true) {
        let zzxw1 = gjfz.透明找图("朱紫校尉坐标","朱紫校尉坐标",x,y,x1,y1,0,0.7)
        if (zzxw1) {
            clickPoint(484,42)
              sleep("1000")
            clickPoint(446,700)
            sleep("300")
            clickPoint(70,32)
            break;
        }else {
            iooi++;
            if (iooi===5){
                clickPoint(512,1172)
                sleep("500")
                clickPoint(580,904)
            }
            if (iooi===300){
            return;
            }


        }}
    sleep("200")
    let ixx = 0 ;
    while (true) {
        let 白色旗 =  ocrjq.烹饪()
        if (白色旗) {
            break;
        } else {
            ixx++;
            let 重叠判断 = gjfz.透明找图("请选择一个角色","请选择一个角色",22,507,582,1097,0,0.7)
            if (重叠判断) {
                logd("请选择要做的事");
                sleep("100")
                gjfz.dzbs("#FFFEFF-#101010","2|-24|#FEFEFC-#101010,33|-106|#3D5D6C-#101010,-32|-108|#30505F-#101010,-29|136|#2F5C6F-#101010,35|136|#385867-#101010,0|50|#4D6C7E-#101010,-5|53|#385B6E-#101010,-4|64|#35586C-#101010,-6|0|#486779-#101010,2|3|#FFFFFF-#101010,2|-5|#FCFCFA-#101010,8|-7|#F2F3F5-#101010,4|-25|#FFFFFF-#101010,7|-30|#385567-#101010,1|-31|#305568-#101010,-4|-28|#31576A-#101010,-4|-23|#305568-#101010,1|-19|#325569-#101010,7|-23|#385469-#101010")
                sleep("500")
            }else {
                if (ixx===3){
                    clickPoint(446,700)
                }
            }
            if (ixx === 5){
                sleep("200")
                clickPoint(463,1190)
                sleep("500")
                clickPoint(596,900)
                sleep("3000")
                clickPoint(446,700)
                sleep("500")
            }
            if (ixx===8){
                return;
            }
        }
    }


    let iix = 0 ;
    while (true) {
        let 给予界面 =  gjfz.透明找图("给予确定", "给予确定", 6,223,141,571, 1, 0.7)
        if (给予界面) {
            return;
        } else {
            sleep("500")
            iix++;
            if (iix===3){
                clickPoint(446,700)
                sleep("800")
                let 白色旗 = gjfz.透明找图("请选择要做的事", "请选择要做的事", 3, 853, 746, 1326, 0, 0.8)
                if (白色旗) {
                   ocrjq.烹饪()
                    sleep("500")
                    gjfz.透明找图("给予确定", "给予确定", 6,223,141,571, 1, 0.7)
                    return;
                }
            }
            if (iix === 5) {
                sleep("500")
                clickPoint(463,1190)
                sleep("500")
                clickPoint(596,900)
                sleep("3000")
                clickPoint(446,700)
                sleep("500")
                let 白色旗 = gjfz.透明找图("请选择要做的事", "请选择要做的事", 3, 853, 746, 1326, 0, 0.8)
                if (白色旗) {
                   ocrjq.烹饪()
                    sleep("500")
                    gjfz.透明找图("给予确定", "给予确定", 6,223,141,571, 1, 0.7)
                    return;
                }
            }
            if (iix===8){
                return;
            }
        }
    }

}
//c1
Csh_function.prototype.小囝囝=function() {
    let iooi = 0;
    let a = gjfz.dzbs( "#FAFAFA-#101010", "11|-59|#2F4246-#101010,6|-46|#EFF1F0-#101010,16|-32|#687677-#101010,10|-20|#FAFAFA-#101010,5|-2|#2F4447-#101010,18|-46|#EFF1F0-#101010,26|-3|#314448-#101010,10|-42|#2F4246-#101010,10|-54|#CFD5D5-#101010",286,666,706,1109)
    if (a===false){
        clickPoint(466,1188)
        sleep(300);
        gjfz.dzbs( "#FAFAFA-#101010", "11|-59|#2F4246-#101010,6|-46|#EFF1F0-#101010,16|-32|#687677-#101010,10|-20|#FAFAFA-#101010,5|-2|#2F4447-#101010,18|-46|#EFF1F0-#101010,26|-3|#314448-#101010,10|-42|#2F4246-#101010,10|-54|#CFD5D5-#101010",286,666,706,1109)
    }
    while (true) {
        let xnn1 = gjfz.透明找图("小囡囡坐标","小囝囝坐标",x,y,x1,y1,0,0.7)
        if (xnn1) {
            sleep("1000")
          //  clickPoint(159,665)
            clickPoint(147,665)
            break;
        }else {
            iooi++;
            if (iooi===5){
                clickPoint(512,1172)
                sleep("500")
                clickPoint(580,904)
            }
            if (iooi===260){
                return;
            }
        }}
    sleep("200")
    let ixx = 0 ;
    while (true) {
        let 白色旗 =   ocrjq.烹饪()
        if (白色旗) {
            break;
        } else {
            ixx++;
            let 重叠判断 = gjfz.透明找图("请选择一个角色","请选择一个角色",22,507,582,1097,0,0.7)
            if (重叠判断) {
                logd("请选择要做的事");
                sleep("100")
                gjfz.dzbs( "#7E8D98-#101010", "-2|0|#FDFDFD-#101010,-40|-124|#374F5E-#101010,29|-124|#425B69-#101010,-38|121|#3A5A6D-#101010,25|122|#3F5766-#101010,-9|-5|#385366-#101010,-3|-5|#3E5366-#101010,-14|6|#476072-#101010,-3|7|#3E5366-#101010,6|-27|#F1F2F4-#101010,5|-27|#FEFEFE-#101010,3|-27|#FFFFFF-#101010,-6|2|#FCFDFD-#101010")
                sleep("500")
            }else {
                sleep(300);
                if (ixx===3){
                   // clickPoint(159,665)
                    clickPoint(147,665)
                }
            }
            if (ixx === 5){
                sleep("200")
                clickPoint(463,1190)
                sleep("500")
                clickPoint(596,900)
                sleep("3000")
               // clickPoint(159,665)
                clickPoint(147,665)
                sleep("500")
            }
            if (ixx===8){
                return;
            }
        }
    }


    let iix = 0 ;
    while (true) {
        let 给予界面 =  gjfz.透明找图("给予确定", "给予确定", 6,223,141,571, 1, 0.7)
        if (给予界面) {
            return;
        } else {
            sleep("500")
            iix++;
            if (iix===3){
                clickPoint(159,665)
                sleep("800")
                let 白色旗 = gjfz.透明找图("请选择要做的事", "请选择要做的事", 3, 853, 746, 1326, 0, 0.8)
                if (白色旗) {
                   ocrjq.烹饪()
                    sleep("500")
                    gjfz.透明找图("给予确定", "给予确定", 6,223,141,571, 1, 0.7)
                    return;
                }
            }
            if (iix === 5) {
                sleep("500")
                clickPoint(463,1190)
                sleep("500")
                clickPoint(596,900)
                sleep("3000")
                clickPoint(446,700)
                sleep("500")
                let 白色旗 = gjfz.透明找图("请选择要做的事", "请选择要做的事", 3, 853, 746, 1326, 0, 0.8)
                if (白色旗) {
                   ocrjq.烹饪()
                    sleep("500")
                    gjfz.透明找图("给予确定", "给予确定", 6,223,141,571, 1, 0.7)
                    return;
                }
            }
            if (iix===8){
                return;
            }
        }
    }

}
//d1
Csh_function.prototype.豆蔻囡囡=function() {
    let iooi = 0;
    let a = gjfz.dzbs( "#FFFFFF-#101010", "1|0|#D6DADB-#101010,-7|-26|#FDFCFA-#101010,-2|-24|#778586-#101010,8|19|#ACB4B6-#101010,5|21|#F0F4F3-#101010,-9|56|#606F72-#101010,3|-22|#758386-#101010,-2|54|#E9EBEA-#101010,-4|63|#C7CDCD-#101010,17|38|#314448-#101010,-3|31|#DBDFE0-#101010,2|15|#3E5155-#101010,-6|5|#C1CAC9-#101010,2|27|#D1D7D7-#101010,-5|37|#B5BDBF-#101010,9|-12|#859094-#101010,8|-3|#EAECEB-#101010,4|-4|#C1C7C7-#101010,15|62|#3E5155-#101010",286,666,706,1109)
    if (a===false){
        clickPoint(466,1188)
        sleep(300);
        gjfz.dzbs( "#FFFFFF-#101010", "1|0|#D6DADB-#101010,-7|-26|#FDFCFA-#101010,-2|-24|#778586-#101010,8|19|#ACB4B6-#101010,5|21|#F0F4F3-#101010,-9|56|#606F72-#101010,3|-22|#758386-#101010,-2|54|#E9EBEA-#101010,-4|63|#C7CDCD-#101010,17|38|#314448-#101010,-3|31|#DBDFE0-#101010,2|15|#3E5155-#101010,-6|5|#C1CAC9-#101010,2|27|#D1D7D7-#101010,-5|37|#B5BDBF-#101010,9|-12|#859094-#101010,8|-3|#EAECEB-#101010,4|-4|#C1C7C7-#101010,15|62|#3E5155-#101010",286,666,706,1109)
    }
        while (true) {
        let dknn1 = gjfz.透明找图("豆蔻囡囡坐标","豆蔻囡囡坐标",x,y,x1,y1,0,0.7)
        if (dknn1) {
            sleep("1000")
            clickPoint(205,668)
            break;
        }else {
            iooi++;
            if (iooi===5){
                clickPoint(512,1172)
                sleep("500")
                clickPoint(580,904)

            }
            if (iooi===260){
                return;
            }
        }}



    sleep("200")
    let ixx = 0 ;
    while (true) {
        let 白色旗 = ocrjq.烹饪()
        if (白色旗) {
            break
        } else {
            ixx++;
            let 重叠判断 = gjfz.透明找图("请选择一个角色","请选择一个角色",22,507,582,1097,0,0.7)
            if (重叠判断) {
                logd("请选择要做的事");
                sleep("100")
                gjfz.dzbs( "#FFFFFF-#101010","-8|5|#385469-#101010,23|-102|#3E626E-#101010,-40|-107|#30505F-#101010,-41|137|#2F5E72-#101010,22|140|#385867-#101010,-10|9|#FFFFFF-#101010,-15|3|#305567-#101010,-10|32|#345568-#101010,-10|61|#345568-#101010,-13|67|#305568-#101010,-17|-23|#305568-#101010,-2|0|#DEE3E7-#101010,-6|-7|#F8F8FA-#101010,-17|-3|#FDFDFD-#101010,-21|-23|#EAEEF1-#101010,-21|-23|#EAEEF1-#101010,-14|61|#FEFEFE-#101010")
                sleep("500")
            }else {
                if (ixx===3){
                    clickPoint(205,668)
                }
            }
            if (ixx === 5){
                sleep("200")
                clickPoint(463,1190)
                sleep("500")
                clickPoint(596,900)
                sleep("3000")
                clickPoint(205,668)
                sleep("500")
            }
            if (ixx===8){
                return;
            }
        }
    }

    sleep(300);
    let iix = 0 ;
    while (true) {
        let 给予界面 =  gjfz.透明找图("给予确定", "给予确定", 6,223,141,571, 1, 0.7)
        if (给予界面) {
            return;
        } else {
            sleep("500")
            iix++;
            if (iix===3){
                clickPoint(446,700)
                sleep("800")
                let 白色旗 = gjfz.透明找图("请选择要做的事", "请选择要做的事", 3, 853, 746, 1326, 0, 0.8)
                if (白色旗) {
                   ocrjq.烹饪()
                    sleep("500")
                    gjfz.透明找图("给予确定", "给予确定", 6,223,141,571, 1, 0.7)
                    return;
                }
            }
            if (iix === 5) {
                sleep("500")
                clickPoint(463,1190)
                sleep("500")
                clickPoint(596,900)
                sleep("3000")
                clickPoint(446,700)
                sleep("500")
                let 白色旗 = gjfz.透明找图("请选择要做的事", "请选择要做的事", 3, 853, 746, 1326, 0, 0.8)
                if (白色旗) {
                   ocrjq.烹饪()
                    sleep("500")
                    gjfz.透明找图("给予确定", "给予确定", 6,223,141,571, 1, 0.7)
                    return;
                }
            }
            if (iix===8){
                return;
            }
        }
    }

}
//e1
Csh_function.prototype.申太公=function() {
    let iooi = 0;
    let a = gjfz.dzbs("#FFFFFF-#101010","12|21|#3E4F56-#101010,10|54|#D5D9DA-#101010,7|59|#788689-#101010,11|51|#35484C-#101010,-4|24|#E8E9EB-#101010,9|58|#3D5054-#101010,7|49|#5F6E73-#101010,14|24|#B5BDBF-#101010,8|33|#36494D-#101010,-6|33|#879294-#101010,15|48|#36494D-#101010,-1|-1|#FAFCFB-#101010,14|48|#4F6165-#101010,14|-6|#304445-#101010,5|57|#8D989C-#101010,16|19|#2F4246-#101010,-3|-10|#36494D-#101010,14|51|#505F62-#101010,-5|50|#EFF1F0-#101010",286,666,706,1109)
    if (a===false){
        clickPoint(466,1188)
        sleep(300);
        gjfz.dzbs("#FFFFFF-#101010","12|21|#3E4F56-#101010,10|54|#D5D9DA-#101010,7|59|#788689-#101010,11|51|#35484C-#101010,-4|24|#E8E9EB-#101010,9|58|#3D5054-#101010,7|49|#5F6E73-#101010,14|24|#B5BDBF-#101010,8|33|#36494D-#101010,-6|33|#879294-#101010,15|48|#36494D-#101010,-1|-1|#FAFCFB-#101010,14|48|#4F6165-#101010,14|-6|#304445-#101010,5|57|#8D989C-#101010,16|19|#2F4246-#101010,-3|-10|#36494D-#101010,14|51|#505F62-#101010,-5|50|#EFF1F0-#101010",286,666,706,1109)
    }
    while (true) {
        let stg1 = gjfz.透明找图("申太公坐标","申太公坐标",x,y,x1,y1,0,0.7)
        if (stg1) {
            sleep(100);
            clickPoint(485,43)
            sleep("1800")
            clickPoint(400,665)
            break;
        }else {
            iooi++;
            if (iooi===3){
                clickPoint(512,1172)
                sleep("500")
                clickPoint(580,904)
                sleep("2000")
            }
            if (iooi===280){
                return;
            }
        }}

    let ixx = 0 ;
    while (true) {
        let 白色旗 =  ocrjq.烹饪()
        if (白色旗) {
            break;
        } else {
            ixx++;
            let 重叠判断 = gjfz.透明找图("请选择一个角色","请选择一个角色",22,507,582,1097,0,0.7)
            if (重叠判断) {
                logd("请选择要做的事");
                sleep("300")
                gjfz.dzbs( "#FFFFFF-#101010", "-6|-1|#FFFFFF-#101010,25|-89|#405867-#101010,-38|-92|#374F5E-#101010,-39|144|#395669-#101010,22|148|#3F5766-#101010,-10|-6|#385366-#101010,-3|-5|#3E5366-#101010,-10|5|#385366-#101010,-3|5|#3E5366-#101010,1|0|#FFFFFF-#101010,0|0|#FFFFFF-#101010,0|28|#FFFFFF-#101010,-7|54|#D0D5DA-#101010,-15|52|#385366-#101010,-15|60|#3C5669-#101010,-3|25|#506375-#101010,-3|31|#465A6D-#101010,-14|25|#EFF1F2-#101010,-14|24|#FEFEFE-#101010")
                sleep("500")
            }else {
                sleep(300);
                let 箱子判断 = gjfz.透明找图("白银箱","白银箱",77,12,397,469,0,0.7)
                if (箱子判断) {
                    sleep(100);
                    clickPoint(193,1298)
                    sleep(100);
                    clickPoint(485,43)
                    sleep(200);
                    clickPoint(442,675)
                }
                if (ixx===3){
                    clickPoint(400,665)
                }
            }
            if (ixx === 4){
                sleep("200")
                clickPoint(463,1190)
                sleep("500")
                clickPoint(596,900)
                sleep("3000")
                clickPoint(400,665)
                sleep("500")
            }
            if (ixx===6){
                return;
            }
        }
    }

    sleep(300);
    let iix = 0 ;
    while (true) {
        let 给予界面 =  gjfz.透明找图("给予确定", "给予确定", 6,223,141,571, 1, 0.7)
        if (给予界面) {
            return;
        } else {
            sleep("500")
            iix++;
            if (iix===3){
                clickPoint(399,671)
                sleep("800")
                let 白色旗 = gjfz.透明找图("请选择要做的事", "请选择要做的事", 3, 853, 746, 1326, 0, 0.8)
                if (白色旗) {
                   ocrjq.烹饪()
                    sleep("500")
                    gjfz.透明找图("给予确定", "给予确定", 6,223,141,571, 1, 0.7)
                    return;
                }
            }
            if (iix === 5) {
                sleep("500")
                clickPoint(463,1190)
                sleep("500")
                clickPoint(596,900)
                sleep("3000")
                clickPoint(399,671)
                sleep("500")
                let 白色旗 = gjfz.透明找图("请选择要做的事", "请选择要做的事", 3, 853, 746, 1326, 0, 0.8)
                if (白色旗) {
                   ocrjq.烹饪()
                    sleep("500")
                    gjfz.透明找图("给予确定", "给予确定", 6,223,141,571, 1, 0.7)
                    return;
                }
            }
            if (iix===8){
                return;
            }
        }
    }

}
//f1
Csh_function.prototype.端木娘子=function() {
    let iooi = 0;
   let a = gjfz.dzbs("#EBEDEC-#101010", "10|31|#FEFEFE-#101010,17|138|#304347-#101010,-18|97|#304347-#101010,-12|-40|#304347-#101010,-15|-42|#304347-#101010,12|-17|#304347-#101010,24|12|#304347-#101010,-20|29|#304347-#101010,1|75|#304347-#101010,5|107|#304347-#101010,10|-61|#304347-#101010,17|-20|#304347-#101010,26|65|#304347-#101010,-3|101|#304347-#101010,23|40|#304347-#101010,19|46|#34464A-#101010,7|-16|#304347-#101010,-7|125|#304347-#101010,-21|82|#304347-#101010",286,666,706,1109)
    if (a===false){
        clickPoint(466,1188)
        sleep(300);
        gjfz.dzbs("#EBEDEC-#101010", "10|31|#FEFEFE-#101010,17|138|#304347-#101010,-18|97|#304347-#101010,-12|-40|#304347-#101010,-15|-42|#304347-#101010,12|-17|#304347-#101010,24|12|#304347-#101010,-20|29|#304347-#101010,1|75|#304347-#101010,5|107|#304347-#101010,10|-61|#304347-#101010,17|-20|#304347-#101010,26|65|#304347-#101010,-3|101|#304347-#101010,23|40|#304347-#101010,19|46|#34464A-#101010,7|-16|#304347-#101010,-7|125|#304347-#101010,-21|82|#304347-#101010",286,666,706,1109)
    }
    while (true) {
        let dmnz1 = gjfz.透明找图("dmnzzb","端木娘子坐标",x,y,x1,y1,0,0.7)
        if (dmnz1) {
            sleep("800")
            clickPoint(265,670)
            break;
        }else {
            iooi++;
            if (iooi===5){
                clickPoint(512,1172)
                sleep("500")
                clickPoint(580,904)
            }
            if (iooi===200){
                return;
            }
        }}

    sleep("200")
    let ixx = 0 ;
    while (true) {
        let 白色旗 =  ocrjq.烹饪()
        if (白色旗) {
            break;
        } else {
            ixx++;
            let 重叠判断 = gjfz.透明找图("请选择一个角色","请选择一个角色",22,507,582,1097,0,0.7)
            if (重叠判断) {
                logd("请选择要做的事");
                sleep("100")
                gjfz.dzbs3("#FBFCFC-#101010", "-13|-3|#C4CED4-#101010,28|-128|#3E606E-#101010,-36|-131|#305060-#101010,-35|116|#305B6F-#101010,28|115|#385868-#101010,1|3|#395569-#101010,2|-55|#385468-#101010,-2|13|#FFFFFF-#101010,1|-16|#FEFEFE-#101010,-1|-1|#FEFEFE-#101010,-3|40|#F9FAFB-#101010")
                sleep("500")
            }else {
                if (ixx===3){
                    clickPoint(446,700)
                }
            }
            if (ixx === 5){
                sleep("200")
                clickPoint(463,1190)
                sleep("500")
                clickPoint(596,900)
                sleep("3000")
                clickPoint(446,700)
                sleep("500")
            }
            if (ixx===8){
                return;
            }
        }
    }


    let iix = 0 ;
    while (true) {
        let 给予界面 =  gjfz.透明找图("给予确定", "给予确定", 6,223,141,571, 1, 0.7)
        if (给予界面) {
            return;
        } else {
            sleep("500")
            iix++;
            if (iix===3){
                clickPoint(446,700)
                sleep("800")
                let 白色旗 = gjfz.透明找图("请选择要做的事", "请选择要做的事", 3, 853, 746, 1326, 0, 0.8)
                if (白色旗) {
                   ocrjq.烹饪()
                    sleep("500")
                    gjfz.透明找图("给予确定", "给予确定", 6,223,141,571, 1, 0.7)
                    return;
                }
            }
            if (iix === 5) {
                sleep("500")
                clickPoint(463,1190)
                sleep("500")
                clickPoint(596,900)
                sleep("3000")
                clickPoint(446,700)
                sleep("500")
                let 白色旗 = gjfz.透明找图("请选择要做的事", "请选择要做的事", 3, 853, 746, 1326, 0, 0.8)
                if (白色旗) {
                  ocrjq.烹饪()
                    sleep("500")
                    gjfz.透明找图("给予确定", "给予确定", 6,223,141,571, 1, 0.7)
                    return;
                }
            }
            if (iix===8){
                return;
            }
        }
    }
}
//直接寻路



//绿色棋子6个点
Csh_function.prototype.长寿村蝴蝶女=function() {
    clickPoint(63,1176);
    ocrjq.绿色旗子()
    doubleClickPoint(438,587)
    sleep("500");
    clickPoint(686,1112)
    sleep("500");

let 循环 = 0
    while (true) {
        let hdn1 = gjfz.透明找图("蝴蝶女坐标","长寿村蝴蝶女坐标",x,y,x1,y1,0,0.7)
        if (hdn1) {
            sleep("300")
            clickPoint(434,716)
            break;
        } else {
            循环++
            if (循环===70) {
               return;
            }
        }
    }
    sleep("200")
    let ixx = 0 ;
    while (true) {
        let 白色旗 = ocrjq.烹饪()
        if (白色旗) {
            break;
        } else {
            ixx++;
            let 重叠判断 = gjfz.透明找图("请选择一个角色","请选择一个角色",22,507,582,1097,0,0.7)
            if (重叠判断) {
                logd("请选择要做的事");
                sleep("100")
                gjfz.dzbs(  "#FDFFFE-#101010","-44|-90|#30505F-#101010,24|-87|#3E626E-#101010,-41|157|#2F5C6F-#101010,25|159|#385867-#101010,-12|0|#F5F6FA-#101010,-15|2|#CDD6DB-#101010,-12|3|#50707F-#101010,-20|0|#486779-#101010,-11|9|#33576D-#101010,-15|30|#476678-#101010,-4|61|#4C6579-#101010,-8|60|#3D5E71-#101010,-10|65|#476474-#101010,2|64|#385469-#101010,-18|-3|#FEFEFF-#101010")
                sleep("500")
            }else {
                if (ixx===3){
                    clickPoint(446,700)
                }
            }
            if (ixx === 5){
                sleep("200")
                clickPoint(463,1190)
                sleep("500")
                clickPoint(596,900)
                sleep("3000")
                clickPoint(446,700)
                sleep("500")
            }
            if (ixx===8){
                return;
            }
        }
    }


    let iix = 0 ;
    while (true) {
        let 给予界面 =  gjfz.透明找图("给予确定", "给予确定", 6,223,141,571, 1, 0.7)
        if (给予界面) {
            return;
        } else {
            sleep("500")
            iix++;
            if (iix===3){
                clickPoint(446,700)
                sleep("800")
                let 白色旗 = gjfz.透明找图("请选择要做的事", "请选择要做的事", 3, 853, 746, 1326, 0, 0.8)
                if (白色旗) {
                  ocrjq.烹饪()
                    sleep("500")
                    gjfz.透明找图("给予确定", "给予确定", 6,223,141,571, 1, 0.7)
                    return;
                }
            }
            if (iix === 5) {
                sleep("500")
                clickPoint(463,1190)
                sleep("500")
                clickPoint(596,900)
                sleep("3000")
                clickPoint(446,700)
                sleep("500")
                let 白色旗 = gjfz.透明找图("请选择要做的事", "请选择要做的事", 3, 853, 746, 1326, 0, 0.8)
                if (白色旗) {
                  ocrjq.烹饪()
                    sleep("500")
                    gjfz.透明找图("给予确定", "给予确定", 6,223,141,571, 1, 0.7)
                    return;
                }
            }
            if (iix===8){
                return;
            }
        }
    }

}
//h1
Csh_function.prototype.凤凰姑娘=function() {
    clickPoint(63,1176);
    ocrjq.绿色旗子()
    sleep("300")
    doubleClickPoint(363,524)
    sleep("800");
    clickPoint(689,1112);
    sleep("800");

    clickPoint(443,683)

    sleep("200")
    let ixx = 0 ;
    while (true) {
        let 白色旗 = gjfz.透明找图("请选择要做的事", "请选择要做的事", 3, 853, 746, 1326, 0, 0.8)
        if (白色旗) {
           ocrjq.烹饪()
            break;
        } else {
            ixx++;
            let 重叠判断 = gjfz.透明找图("请选择一个角色","请选择一个角色",22,507,582,1097,0,0.7)
            if (重叠判断) {
                logd("请选择要做的事");
                sleep("100")
                gjfz.dzbs( "#F9F9F9-#101010", "5|-2|#FDFDFB-#101010,4|-1|#FFFFFF-#101010,-40|-108|#30505F-#101010,29|-105|#385867-#101010,28|134|#385867-#101010,-37|133|#2F5E72-#101010,-15|-1|#FEFEFE-#101010,-4|-28|#39556A-#101010,-8|-32|#305366-#101010,-12|7|#4A697B-#101010,-7|20|#3A5D70-#101010,-4|33|#FFFFFF-#101010,2|60|#385469-#101010,5|59|#FCFEFD-#101010,-12|58|#2F5467-#101010,-15|56|#F8FAF9-#101010")
                sleep("500")
            }else {
                if (ixx===3){
                    clickPoint(446,700)
                }
            }
            if (ixx === 5){
                sleep("200")
                clickPoint(463,1190)
                sleep("500")
                clickPoint(596,900)
                sleep("3000")
                clickPoint(446,700)
                sleep("500")
                if (ixx===8){
                    return;
                }
            }
        }
    }


    let iix = 0 ;
    while (true) {
        let 给予界面 =  gjfz.透明找图("给予确定", "给予确定", 6,223,141,571, 1, 0.7)
        if (给予界面) {
            return;
        } else {
            sleep("500")
            iix++;
            if (iix===3){
                clickPoint(446,700)
                sleep("800")
                let 白色旗 = gjfz.透明找图("请选择要做的事", "请选择要做的事", 3, 853, 746, 1326, 0, 0.8)
                if (白色旗) {
                  ocrjq.烹饪()
                    sleep("500")
                    gjfz.透明找图("给予确定", "给予确定", 6,223,141,571, 1, 0.7)
                    return;
                }
            }
            if (iix === 5) {
                sleep("500")
                clickPoint(463,1190)
                sleep("500")
                clickPoint(596,900)
                sleep("3000")
                clickPoint(446,700)
                sleep("500")
                let 白色旗 = gjfz.透明找图("请选择要做的事", "请选择要做的事", 3, 853, 746, 1326, 0, 0.8)
                if (白色旗) {
                  ocrjq.烹饪()
                    sleep("500")
                    gjfz.透明找图("给予确定", "给予确定", 6,223,141,571, 1, 0.7)
                    return;
                }
            }
            if (iix===8){
                return;
            }
        }
    }

}
//i1
Csh_function.prototype.许大娘=function() {
    clickPoint(63,1176);
    ocrjq.绿色旗子()
    sleep("300")
    doubleClickPoint(256,662)
    sleep("800");
    clickPoint(689,1112);
    sleep("1200");
    clickPoint(484,42)
    sleep("800")
    clickPoint(398,668)
    sleep("300")
    let ixx = 0 ;
    while (true) {
        let 白色旗 = ocrjq.烹饪()
        if (白色旗) {
            break;
        } else {
            ixx++;
            let 重叠判断 = gjfz.透明找图("请选择一个角色","请选择一个角色",22,507,582,1097,0,0.7)
            if (重叠判断) {
                logd("请选择要做的事");
                sleep("300")
                gjfz.透明找图("许大娘","许大娘",22,507,582,1097,1,0.7)
                sleep("500")
            }else {
                if (ixx===3){
                    sleep("200")
                    clickPoint(398,668)
                }
            }
            if (ixx === 5){
                sleep("200")
                clickPoint(463,1190)
                sleep("500")
                clickPoint(596,900)
                sleep("4000")
                clickPoint(398,668)
                sleep("500")
            }
            if (ixx===8){
                return;
            }

        }
    }


    let iix = 0 ;
    while (true) {
        let 给予界面 =  gjfz.透明找图("给予确定", "给予确定", 6,223,141,571, 1, 0.7)
        if (给予界面) {
            return;
        } else {
            sleep("500")
            iix++;
            if (iix===3){
                clickPoint(446,700)
                sleep("800")
                let 白色旗 = gjfz.透明找图("请选择要做的事", "请选择要做的事", 3, 853, 746, 1326, 0, 0.8)
                if (白色旗) {
                  ocrjq.烹饪()
                    sleep("500")
                    gjfz.透明找图("给予确定", "给予确定", 6,223,141,571, 1, 0.7)
                    return;
                }
            }
            if (iix === 5) {
                sleep("500")
                clickPoint(463,1190)
                sleep("500")
                clickPoint(596,900)
                sleep("3000")
                clickPoint(446,700)
                sleep("500")
                let 白色旗 = gjfz.透明找图("请选择要做的事", "请选择要做的事", 3, 853, 746, 1326, 0, 0.8)
                if (白色旗) {
                  ocrjq.烹饪()
                    sleep("500")
                    gjfz.透明找图("给予确定", "给予确定", 6,223,141,571, 1, 0.7)
                    return;
                }
            }
            if (iix===8){
                return;
            }
        }
    }

}
//j1
Csh_function.prototype.许姑娘=function() {
    clickPoint(63,1176);
    ocrjq.绿色旗子()
    sleep("300")
    doubleClickPoint(525,654)
    sleep("800");
    clickPoint(689,1112);
    sleep("500");
    let 循环 = 0
    while (true) {
        let ccs1 = gjfz.透明找图("许姑娘坐标","许姑娘坐标",626,0,734,252,0,0.7)
        if (ccs1) {
            sleep("300")
            clickPoint(454,754)
            break;
        } else {
            循环++
            sleep(100);
            if (循环===70) {
                return;
            }
        }
    }
    sleep("200")
    let ixx = 0 ;
    while (true) {
        let 白色旗 = ocrjq.烹饪()
        if (白色旗) {
            break;
        } else {
            ixx++;
            let 重叠判断 = gjfz.透明找图("请选择一个角色","请选择一个角色",22,507,582,1097,0,0.7)
            if (重叠判断) {
                logd("请选择要做的事");
                sleep("100")
                gjfz.dzbs("#FFFFFF-#101010","1|0|#FFFFFF-#101010,-3|-4|#395467-#101010,15|-115|#385867-#101010,-29|-122|#305067-#101010,-34|88|#305164-#101010,23|92|#385867-#101010,-5|16|#3A566B-#101010,-14|26|#31556B-#101010,-10|30|#385B6E-#101010,-5|27|#5D7484-#101010,0|27|#37566B-#101010,-7|22|#FEFEFE-#101010,-9|18|#E9EEF1-#101010,-13|16|#FFFFFD-#101010,-13|-12|#FFFFFF-#101010,0|-15|#FDFDFD-#101010,-4|-5|#38546A-#101010,-12|-33|#305568-#101010,-4|-31|#385469-#101010,4|-37|#39556A-#101010,0|-45|#385469-#101010,-7|-44|#385469-#101010")
                sleep("500")
            }else {
                if (ixx===3){
                    clickPoint(446,700)
                }
            }
            if (ixx === 5){
                sleep("200")
                clickPoint(463,1190)
                sleep("500")
                clickPoint(596,900)
                sleep("3000")
                clickPoint(446,700)
                sleep("500")
            }
            if (ixx===8){
                return;
            }

        }
    }


    let iix = 0 ;
    while (true) {
        let 给予界面 =  gjfz.透明找图("给予确定", "给予确定", 6,223,141,571, 1, 0.7)
        if (给予界面) {
            return;
        } else {
            sleep("500")
            iix++;
            if (iix===3){
                clickPoint(446,700)
                sleep("800")
                let 白色旗 = gjfz.透明找图("请选择要做的事", "请选择要做的事", 3, 853, 746, 1326, 0, 0.8)
                if (白色旗) {
                  ocrjq.烹饪()

                    sleep("500")
                    gjfz.透明找图("给予确定", "给予确定", 6,223,141,571, 1, 0.7)
                    return;
                }
            }
            if (iix === 5) {
                sleep("500")
                clickPoint(463,1190)
                sleep("500")
                clickPoint(596,900)
                sleep("3000")
                clickPoint(446,700)
                sleep("500")
                let 白色旗 = gjfz.透明找图("请选择要做的事", "请选择要做的事", 3, 853, 746, 1326, 0, 0.8)
                if (白色旗) {
                  ocrjq.烹饪()
                    sleep("500")
                    gjfz.透明找图("给予确定", "给予确定", 6,223,141,571, 1, 0.7)
                    return;
                }
            }
            if (iix===8){
                return;
            }
        }
    }
}
//k1
Csh_function.prototype.海老先生=function() {
    clickPoint(63,1176);
    ocrjq.绿色旗子()
    sleep("300")
    doubleClickPoint(190,720)
    sleep("500");
    clickPoint(689,1112);
    sleep("500");
    clickPoint(493,43)
     sleep("500")
    clickPoint(425,771)
    sleep("300")
    clickPoint(70,32)
    sleep("500")
    let ixx = 0 ;
    while (true) {
        let 白色旗 = ocrjq.烹饪()
        if (白色旗) {
            break;
        } else {
            ixx++;
            sleep(300);
            let 重叠判断 = gjfz.透明找图("请选择一个角色","请选择一个角色",22,507,582,1097,0,0.7)
            if (重叠判断) {
                logd("请选择要做的事");
                sleep("300")
                gjfz.透明找图("海老先生","海老先生",22,507,582,1097,2,0.7)
                sleep("500")
            }else {
                if (ixx===3){
                    clickPoint(425,771)
                }
            }
            if (ixx === 5){
                sleep("200")
                clickPoint(463,1190)
                sleep("500")
                clickPoint(596,900)
                sleep("3000")
                clickPoint(425,771)
                sleep("500")
            }
            if (ixx===8){
                return;
            }
        }
    }


    let iix = 0 ;
    while (true) {
        let 给予界面 =  gjfz.透明找图("给予确定", "给予确定", 6,223,141,571, 1, 0.7)
        if (给予界面) {
            return;
        } else {
            sleep("500")
            iix++;
            if (iix===3){
                clickPoint(425,771)
                sleep("800")
                let 白色旗 = gjfz.透明找图("请选择要做的事", "请选择要做的事", 3, 853, 746, 1326, 0, 0.8)
                if (白色旗) {
                  ocrjq.烹饪()
                    sleep("500")
                    gjfz.透明找图("给予确定", "给予确定", 6,223,141,571, 1, 0.7)
                    return;
                }
            }
            if (iix === 5) {
                sleep("500")
                clickPoint(463,1190)
                sleep("500")
                clickPoint(596,900)
                sleep("3000")
                clickPoint(425,771)
                sleep("500")
                let 白色旗 = gjfz.透明找图("请选择要做的事", "请选择要做的事", 3, 853, 746, 1326, 0, 0.8)
                if (白色旗) {
                  ocrjq.烹饪()
                    sleep("500")
                    gjfz.透明找图("给予确定", "给予确定", 6,223,141,571, 1, 0.7)
                    return;
                }
            }
            if (iix===8){
                return;
            }
        }
    }








}
//l
Csh_function.prototype.慧觉和尚=function() {
    clickPoint(63,1176);
    ocrjq.绿色旗子()
    sleep("300")
    doubleClickPoint(259,788)
    sleep("800");
    clickPoint(689,1112);
    sleep("800")
    clickPoint(484,42)
    sleep("800");
    clickPoint(521,698)
    sleep("200")
    let ixx = 0 ;
    while (true) {
        sleep("200")
        let 白色旗 = gjfz.透明找图("慧觉和尚烹饪", "点击烹饪任务", 210,936,740,1324, 1, 0.7)
        if (白色旗) {
           logd("点击")
            break;
        } else {
            ixx++;
            let 重叠判断 = gjfz.透明找图("请选择一个角色","请选择一个角色",22,507,582,1097,0,0.7)
            if (重叠判断) {
                logd("请选择要做的事");
                sleep("100")
                gjfz.dzbs("#E2EDF3-#101010","2|31|#D0DCE6-#101010,-8|28|#E2EBF4-#101010,-9|34|#F4FAFE-#101010,26|-72|#395869-#101010,-32|-73|#334F61-#101010,-27|159|#31505F-#101010,34|161|#395869-#101010,-2|86|#2E546A-#101010,1|65|#36536B-#101010,2|57|#3E5360-#101010,10|58|#4B6070-#101010,-1|53|#E7E8EC-#101010,9|48|#3D5262-#101010,-2|34|#355261-#101010,-2|27|#365969-#101010,-2|18|#2E546A-#101010,-7|1|#4A626E-#101010,-6|6|#405968-#101010,9|3|#4D5D67-#101010,0|-4|#E7E8EC-#101010,9|3|#4D5D67-#101010,-7|0|#41545D-#101010")
                sleep("500")
            }else {
                if (ixx===3){
                    clickPoint(446,700)
                }
            }
            if (ixx === 5){
                sleep("200")
                clickPoint(463,1190)
                sleep("500")
                clickPoint(596,900)
                sleep("3000")
                clickPoint(431,642)
                sleep("500")
            }
            if (ixx===8){
                return;
            }

        }
    }


    let iix = 0 ;
    while (true) {
        let 给予界面 =  gjfz.透明找图("给予确定", "给予确定", 6,223,141,571, 1, 0.7)
        if (给予界面) {
            return;
        } else {
            sleep("500")
            iix++;
            if (iix===3){
                clickPoint(446,700)
                sleep("800")
                let 白色旗 = gjfz.透明找图("请选择要做的事", "请选择要做的事", 3, 853, 746, 1326, 0, 0.8)
                if (白色旗) {
                  ocrjq.烹饪()
                    sleep("500")
                    gjfz.透明找图("给予确定", "给予确定", 6,223,141,571, 1, 0.7)
                    return;
                }
            }
            if (iix === 5) {
                sleep("500")
                clickPoint(463,1190)
                sleep("500")
                clickPoint(596,900)
                sleep("3000")
                clickPoint(446,700)
                sleep("500")
                let 白色旗 = gjfz.透明找图("请选择要做的事", "请选择要做的事", 3, 853, 746, 1326, 0, 0.8)
                if (白色旗) {
                  ocrjq.烹饪()
                    sleep("500")
                    gjfz.透明找图("给予确定", "给予确定", 6,223,141,571, 1, 0.7)
                    return;
                }
            }
            if (iix===8){
                return;
            }
        }
    }

}
//绿色棋子6个点,1



//建邺，飞行符
Csh_function.prototype.教书先生=function() {

    ocrjq.建邺()

   // let io = 0
    let 循环 = 0
    while (true){
        let jsxs1 = gjfz.透明找图("jsxszb","教书先生坐标",x,y,x1,y1,0,0.7)
        if (jsxs1) {
           // io++
            // if (io===3){
            //     clickPoint(462, 1192)
            //     sleep("500")
            //     clickPoint(596, 896)
            // }
            sleep("1600");
            clickPoint(384,696)

            break;
        }else {
            循环++
            if (循环===250) {
            return;
            }
            sleep(100);

        }
    }
    sleep("200")
    let ixx = 0 ;
    while (true) {
        let 白色旗 =  ocrjq.烹饪()
        if (白色旗) {

            break;
        } else {
            ixx++;
            let 重叠判断 = gjfz.透明找图("请选择一个角色","请选择一个角色",22,507,582,1097,0,0.7)
            if (重叠判断) {
                logd("请选择要做的事");
                sleep("100")
                gjfz.dzbs("#FFFFFF-#101010","-4|31|#FFFFFF-#101010,-4|44|#F1F3F5-#101010,-2|62|#FFFFFF-#101010,30|-76|#3B5C6B-#101010,-39|-76|#305060-#101010,-38|168|#305A6E-#101010,31|170|#385868-#101010,-3|31|#FFFFFF-#101010,-6|64|#FFFFFF-#101010,-10|90|#F2F4F6-#101010,-15|31|#DFE5E8-#101010,5|31|#F4F5F6-#101010")
                sleep("500")
            }else {
                if (ixx===3){
                    clickPoint(446,700)
                }
            }
            if (ixx === 5){
                sleep("200")
                clickPoint(463,1190)
                sleep("500")
                clickPoint(596,900)
                sleep("3000")
                clickPoint(446,700)
                sleep("500")
            }
            if (ixx===8){
                return;
            }
        }
    }


    let iix = 0 ;
    while (true) {
        let 给予界面 =  gjfz.透明找图("给予确定", "给予确定", 6,223,141,571, 1, 0.7)
        if (给予界面) {
            return;
        } else {
            sleep("500")
            iix++;
            if (iix===3){
                clickPoint(446,700)
                sleep("800")
                let 白色旗 = gjfz.透明找图("请选择要做的事", "请选择要做的事", 3, 853, 746, 1326, 0, 0.8)
                if (白色旗) {
                  ocrjq.烹饪()
                    sleep("500")
                    gjfz.透明找图("给予确定", "给予确定", 6,223,141,571, 1, 0.7)
                    return;
                }
            }
            if (iix === 5) {
                sleep("500")
                clickPoint(463,1190)
                sleep("500")
                clickPoint(596,900)
                sleep("3000")
                clickPoint(446,700)
                sleep("500")
                let 白色旗 = gjfz.透明找图("请选择要做的事", "请选择要做的事", 3, 853, 746, 1326, 0, 0.8)
                if (白色旗) {
                  ocrjq.烹饪()
                    sleep("500")
                    gjfz.透明找图("给予确定", "给予确定", 6,223,141,571, 1, 0.7)
                    return;
                }
            }
            if (iix===8){
                return;
            }
        }
    }

}
//m1
Csh_function.prototype.马全有=function() {

    ocrjq.建邺()

    // gjfz.dzbs("#5F7173-#101010", "-20|34|#304347-#101010,-12|0|#FAFAFA-#101010,7|31|#5F6E71-#101010,-8|43|#8C9698-#101010,-6|53|#959FA1-#101010,-12|36|#C9CFCF-#101010,-14|52|#3A4D51-#101010,-4|-16|#324448-#101010,-7|26|#7E898B-#101010,-2|-8|#F2F2F2-#101010,-5|15|#9EA8AA-#101010,1|47|#899496-#101010,7|35|#D2D6D7-#101010,0|19|#AFB7B9-#101010,-9|19|#7F8A8E-#101010,-16|32|#2F4246-#101010,-1|30|#768485-#101010,7|44|#D4D5D9-#101010,-10|51|#CBD1CF-#101010,4|42|#536267-#101010")
let 循环 = 0
    while (true){
        let mqy1 = gjfz.透明找图("马全友坐标","马全有坐标",x,y,x1,y1,0,0.7)
        if (mqy1) {
           // gjfz.dzbs( "#1E2F39-#101010","-5|-4|#22333B-#101010,-9|14|#C69C54-#101010,13|5|#2E3D40-#101010,6|-4|#B7AA7E-#101010,-11|-19|#2E3B41-#101010,5|-1|#1A2E35-#101010,7|-17|#616254-#101010,1|12|#1F3239-#101010,8|11|#BFA779-#101010,13|-12|#F1D498-#101010,9|-5|#6E7A66-#101010,16|-12|#F2D7A0-#101010,17|-4|#20333A-#101010,16|-17|#CBC392-#101010,16|6|#F0D79F-#101010,-2|-17|#1F3038-#101010,-2|5|#AEA981-#101010,8|-12|#2E3D42-#101010,0|2|#48514C-#101010")
            sleep(200);
            clickPoint(485,44)
            sleep("1200")
            clickPoint(413, 676)
            sleep("500")
            clickPoint(70,32)

            break;
        }else {
            循环++
            sleep(100);
            if (循环===100) {
                return;
            }
            // if (循环===5) {
            //     sleep(300);
            //     gjfz.透明找图("xx","关闭",388,645,746,1256,1,0.7)
            //     sleep(300);
            //     clickPoint(462, 1192)
            //     sleep("500")
            //     clickPoint(596, 896)
            // }
            // if (循环===8) {
            //     sleep(300);
            //     gjfz.透明找图("xx","关闭",388,645,746,1256,1,0.7)
            //     sleep(300);
            //     clickPoint(462, 1192)
            //     sleep("500")
            //     clickPoint(596, 896)
            // }
            // if (循环===20) {
            //     return;
            // }
        }
    }
    sleep("200")
    let ixx = 0 ;
    while (true) {
        let 白色旗 = ocrjq.烹饪()
        if (白色旗) {
            break;
        } else {
            ixx++;
            let 重叠判断 = gjfz.透明找图("请选择一个角色","请选择一个角色",22,507,582,1097,0,0.7)
            if (重叠判断) {
                logd("请选择要做的事");
                sleep("100")
                gjfz.dzbs( "#FBFCFC-#101010","-43|-92|#305060-#101010,22|-92|#3B5B6B-#101010,-45|149|#305C70-#101010,29|153|#385868-#101010,4|34|#FFFFFF-#101010,-8|34|#FFFFFF-#101010,-1|34|#385468-#101010,-15|68|#32566A-#101010,-12|34|#FFFFFF-#101010")
                sleep("500")
            }else {
                if (ixx===3){
                    clickPoint(446,700)
                }
            }
            if (ixx === 5){
                sleep("200")
                clickPoint(463,1190)
                sleep("500")
                clickPoint(596,900)
                sleep("3000")
                clickPoint(485,44)
                sleep(500);
                clickPoint(446,700)
                sleep("500")
            }
            if (ixx===8){
                return;
            }
        }
    }


    let iix = 0 ;
    while (true) {
        let 给予界面 =  gjfz.透明找图("给予确定", "给予确定", 6,223,141,571, 1, 0.7)
        if (给予界面) {
            return;
        } else {
            sleep("500")
            iix++;
            if (iix===3){
                clickPoint(446,700)
                sleep("800")
                let 白色旗 = gjfz.透明找图("请选择要做的事", "请选择要做的事", 3, 853, 746, 1326, 0, 0.8)
                if (白色旗) {
                  ocrjq.烹饪()
                    sleep("500")
                    gjfz.透明找图("给予确定", "给予确定", 6,223,141,571, 1, 0.7)
                    return;
                }
            }
            if (iix === 5) {
                sleep("500")
                clickPoint(463,1190)
                sleep("500")
                clickPoint(596,900)
                sleep("3000")
                clickPoint(446,700)
                sleep("500")
                let 白色旗 = gjfz.透明找图("请选择要做的事", "请选择要做的事", 3, 853, 746, 1326, 0, 0.8)
                if (白色旗) {
                  ocrjq.烹饪()
                    sleep("500")
                    gjfz.透明找图("给予确定", "给予确定", 6,223,141,571, 1, 0.7)
                    return;
                }
            }
            if (iix===8){
                return;
            }
        }
    }

}
//n1n
Csh_function.prototype.雷黑子=function() {
    ocrjq.建邺()

    // gjfz.dzbs( "#FFFEFF-#101010","-7|-2|#F5F7F6-#101010,-13|28|#CBD1D1-#101010,-6|31|#E6E7E9-#101010,4|56|#FFFFFF-#101010,10|-14|#314448-#101010,-4|28|#627174-#101010,-3|17|#B6BBBE-#101010,8|-13|#2F4246-#101010,-3|-10|#627174-#101010,-2|28|#E8E8EA-#101010,-17|53|#304349-#101010,3|26|#7B898A-#101010,-18|-10|#314347-#101010,-18|16|#314448-#101010,-6|-6|#C3C8CB-#101010,-11|24|#788687-#101010,-15|0|#FBFBFB-#101010,-10|2|#8D989A-#101010,9|42|#2F4246-#101010")
let 循环 = 0
    while (true){
        let lhz1 = gjfz.透明找图("雷黑子坐标","雷黑子坐标",x,y,x1,y1,0,0.7)
        if (lhz1) {
           // gjfz.dzbs( "#1E2F39-#101010","-5|-4|#22333B-#101010,-9|14|#C69C54-#101010,13|5|#2E3D40-#101010,6|-4|#B7AA7E-#101010,-11|-19|#2E3B41-#101010,5|-1|#1A2E35-#101010,7|-17|#616254-#101010,1|12|#1F3239-#101010,8|11|#BFA779-#101010,13|-12|#F1D498-#101010,9|-5|#6E7A66-#101010,16|-12|#F2D7A0-#101010,17|-4|#20333A-#101010,16|-17|#CBC392-#101010,16|6|#F0D79F-#101010,-2|-17|#1F3038-#101010,-2|5|#AEA981-#101010,8|-12|#2E3D42-#101010,0|2|#48514C-#101010")
            clickPoint(482,42)
            sleep("1300")
            clickPoint(308,667)
            sleep("500")
            //clickPoint(70,32)

            break;
        }
        else {
            循环++
            sleep(100);
            if (循环===120) {
              return;
                }
            // }
            // if (循环===5) {
            //     sleep(300);
            //     gjfz.透明找图("xx","关闭",388,645,746,1256,1,0.7)
            //     sleep(300);
            //     clickPoint(462, 1192)
            //     sleep("500")
            //     clickPoint(596, 896)
            // }
            // if (循环===8) {
            //     sleep(300);
            //     gjfz.透明找图("xx","关闭",388,645,746,1256,1,0.7)
            //     sleep(300);
            //     clickPoint(462, 1192)
            //     sleep("500")
            //     clickPoint(596, 896)
            // }
            // if (循环===10) {
            //     return;
            // }
        }}
    sleep("200")
    let ixx = 0 ;
    while (true) {
        let 白色旗 = ocrjq.烹饪()
        if (白色旗) {
            break;
        } else {
            ixx++;
            sleep(200);
            let 重叠判断 = gjfz.透明找图("请选择一个角色","请选择一个角色",22,507,582,1097,0,0.7)
            if (重叠判断) {
                logd("请选择要做的事");
                sleep("200")
                gjfz.透明找图("雷黑子","点击雷黑子判断角色",22,507,582,1097,1,0.7)
                sleep("500")
            }else {
                if (ixx===3){
                    clickPoint(446,700)
                }
            }
            if (ixx === 5){
                sleep("200")
                clickPoint(463,1190)
                sleep("500")
                clickPoint(596,900)
                sleep("3000")
                clickPoint(446,700)
                sleep("500")
            }
             if (ixx===8){
                 return;
             }
        }
    }


    let iix = 0 ;
    while (true) {
        let 给予界面 =  gjfz.透明找图("给予确定", "给予确定", 6,223,141,571, 1, 0.7)
        if (给予界面) {
            return;
        } else {
            sleep("500")
            iix++;
            if (iix===3){
                clickPoint(446,700)
                sleep("800")
                let 白色旗 = gjfz.透明找图("请选择要做的事", "请选择要做的事", 3, 853, 746, 1326, 0, 0.8)
                if (白色旗) {
                  ocrjq.烹饪()
                    sleep("500")
                    gjfz.透明找图("给予确定", "给予确定", 6,223,141,571, 1, 0.7)
                    return;
                }
            }
            if (iix === 5) {
                sleep("500")
                clickPoint(463,1190)
                sleep("500")
                clickPoint(596,900)
                sleep("3000")
                clickPoint(446,700)
                sleep("500")
                let 白色旗 = gjfz.透明找图("请选择要做的事", "请选择要做的事", 3, 853, 746, 1326, 0, 0.8)
                if (白色旗) {
                  ocrjq.烹饪()
                    sleep("500")
                    gjfz.透明找图("给予确定", "给予确定", 6,223,141,571, 1, 0.7)
                    return;
                }
            }
            if (iix===8){
                return;
            }
        }
    }

}
//o1
Csh_function.prototype.刘老爹=function() {}
//p1
Csh_function.prototype.陈长寿=function() {
    ocrjq.建邺()
let iooi = 0 ;
    while (true) {
        let ccs1 = gjfz.透明找图("陈长寿坐标","陈长寿坐标",x,y,x1,y1,0,0.7)
        if (ccs1) {
            sleep("800")
            clickPoint(425,666)
            break;
        }else {
            iooi++
            if (iooi===410){
                return;
            }
                sleep(100);


        }}
    sleep("200")




    let ixx = 0 ;
    while (true) {
        let 白色旗 = ocrjq.烹饪()
        if (白色旗) {
            break;
        } else {
            ixx++;
            sleep(500)
            let 重叠判断 = gjfz.透明找图("请选择一个角色","请选择一个角色",22,507,582,1097,0,0.7)
            if (重叠判断) {
                logd("请选择要做的事");
                sleep("100")
                gjfz.dzbs( "#FFFFFF-#101010","-2|21|#FFFFFF-#101010,-6|49|#FDFDFE-#101010,-40|-98|#305060-#101010,26|-99|#3C5D6C-#101010,-35|146|#305C70-#101010,28|147|#385868-#101010,1|25|#EEF1F2-#101010,8|2|#F4F6F7-#101010,-14|23|#FCFDFD-#101010")
                sleep("500")
            }else {
                if (ixx===3){
                    clickPoint(446,700)
                }
            }
            if (ixx === 5){
                sleep("200")
                clickPoint(463,1190)
                sleep("500")
                clickPoint(596,900)
                sleep("3000")
                clickPoint(446,700)
                sleep("500")
            }
            if (ixx===8){
                return;
            }
        }
    }


    let iix = 0 ;
    while (true) {
        let 给予界面 =  gjfz.透明找图("给予确定", "给予确定", 6,223,141,571, 1, 0.7)
        if (给予界面) {
            return;
        } else {
            sleep("500")
            iix++;
            if (iix===3){
                clickPoint(446,700)
                sleep("800")
                let 白色旗 = gjfz.透明找图("请选择要做的事", "请选择要做的事", 3, 853, 746, 1326, 0, 0.8)
                if (白色旗) {
                  ocrjq.烹饪()
                    sleep("500")
                    gjfz.透明找图("给予确定", "给予确定", 6,223,141,571, 1, 0.7)
                    return;
                }
            }
            if (iix === 5) {
                sleep("500")
                clickPoint(463,1190)
                sleep("500")
                clickPoint(596,900)
                sleep("3000")
                clickPoint(446,700)
                sleep("500")
                let 白色旗 = gjfz.透明找图("请选择要做的事", "请选择要做的事", 3, 853, 746, 1326, 0, 0.8)
                if (白色旗) {
                  ocrjq.烹饪()
                    sleep("500")
                    gjfz.透明找图("给予确定", "给予确定", 6,223,141,571, 1, 0.7)
                    return;
                }
            }
            if (iix===8){
                return;
            }
        }
    }

}
//q1q
Csh_function.prototype.迎客僧=function() {

    ocrjq.建邺()

    //  gjfz.dzbs("#B1B6B9-#101010", "-2|0|#C0C8CA-#101010,-7|-1|#778586-#101010,-13|-21|#6B797C-#101010,-2|-43|#304347-#101010,2|-34|#D2D6D7-#101010,5|-8|#435257-#101010,4|23|#A1ABAD-#101010,-1|32|#FBFBFB-#101010,-11|22|#FCFAFB-#101010,-14|-17|#2F4447-#101010,-19|-48|#304347-#101010,11|-55|#304347-#101010,19|19|#304347-#101010,8|59|#304347-#101010,-21|37|#304347-#101010,-25|-113|#344B53-#101010,-26|117|#304347-#101010")
let 循环 = 0
    while (true){
        let zyb1 = gjfz.透明找图("ykszb","迎客僧坐标",626,0,734,252,0,0.7)
        if (zyb1) {
            sleep(200);
            gjfz.dzbs( "#1E2F39-#101010","-5|-4|#22333B-#101010,-9|14|#C69C54-#101010,13|5|#2E3D40-#101010,6|-4|#B7AA7E-#101010,-11|-19|#2E3B41-#101010,5|-1|#1A2E35-#101010,7|-17|#616254-#101010,1|12|#1F3239-#101010,8|11|#BFA779-#101010,13|-12|#F1D498-#101010,9|-5|#6E7A66-#101010,16|-12|#F2D7A0-#101010,17|-4|#20333A-#101010,16|-17|#CBC392-#101010,16|6|#F0D79F-#101010,-2|-17|#1F3038-#101010,-2|5|#AEA981-#101010,8|-12|#2E3D42-#101010,0|2|#48514C-#101010")
            sleep("500")
            clickPoint(424,267)
            sleep("500")
            break;
        }
        else {
            sleep("100")
            循环++
            if (循环===210) {
            return;
            }
        }}
    sleep("200")
    let ixx = 0 ;
    while (true) {
        let 白色旗 = ocrjq.烹饪()
        if (白色旗) {
            break;
        } else {
            sleep(500)
            ixx++;
            let 重叠判断 = gjfz.透明找图("请选择一个角色","请选择一个角色",22,507,582,1097,0,0.7)
            if (重叠判断) {
                logd("请选择要做的事");
                sleep("100")
                gjfz.dzbs( "#F9FAFB-#101010","-42|-152|#305060-#101010,28|-148|#3F626F-#101010,-39|92|#305B6F-#101010,25|96|#385868-#101010,-10|3|#4E6D7E-#101010,-14|3|#385A6E-#101010,-4|-11|#FCFCFC-#101010,-15|-9|#FAFBFB-#101010,-1|3|#F8F9FA-#101010,-1|-26|#516A7B-#101010,0|2|#728594-#101010,1|1|#5F7585-#101010")
                sleep("500")
            }else {
                if (ixx===3){
                    clickPoint(446,700)
                }
            }
            if (ixx === 5){
                sleep("200")
                clickPoint(463,1190)
                sleep("500")
                clickPoint(596,900)
                sleep("3000")
                clickPoint(446,700)
                sleep("500")
            }
            if (ixx===8){
                return;
            }
        }
    }


    let iix = 0 ;
    while (true) {
        let 给予界面 =  gjfz.透明找图("给予确定", "给予确定", 6,223,141,571, 1, 0.7)
        if (给予界面) {
            return;
        } else {
            sleep("500")
            iix++;
            if (iix===3){
                clickPoint(446,700)
                sleep("800")
                let 白色旗 = gjfz.透明找图("请选择要做的事", "请选择要做的事", 3, 853, 746, 1326, 0, 0.8)
                if (白色旗) {
                  ocrjq.烹饪()
                    sleep("500")
                    gjfz.透明找图("给予确定", "给予确定", 6,223,141,571, 1, 0.7)
                    return;
                }
            }
            if (iix === 5) {
                sleep("500")
                clickPoint(463,1190)
                sleep("500")
                clickPoint(596,900)
                sleep("3000")
                clickPoint(446,700)
                sleep("500")
                let 白色旗 = gjfz.透明找图("请选择要做的事", "请选择要做的事", 3, 853, 746, 1326, 0, 0.8)
                if (白色旗) {
                  ocrjq.烹饪()
                    sleep("500")
                    gjfz.透明找图("给予确定", "给予确定", 6,223,141,571, 1, 0.7)
                    return;
                }
            }
            if (iix===8){
                return;
            }
        }
    }
}
//r1
Csh_function.prototype.赵元宝=function() {
    ocrjq.建邺()

    // gjfz.dzbs( "#D1D7D7-#101010", "11|25|#F9F9F9-#101010,-4|51|#606F72-#101010,-1|30|#2F4246-#101010,17|60|#7D8B8C-#101010,-4|19|#909B9D-#101010,14|50|#627474-#101010,17|20|#839194-#101010,11|37|#FAF8F9-#101010,-2|25|#314448-#101010,13|60|#5C6B6E-#101010,17|-7|#3D4F51-#101010,-4|-9|#304548-#101010,16|16|#384950-#101010,1|33|#F9F9F9-#101010,0|33|#F9FBFA-#101010,-2|-7|#A5ADAF-#101010,14|-4|#748285-#101010,5|62|#FEFEFE-#101010,7|7|#7F8E91-#101010")
let iooi = 0
    while (true){
        let zyb1 = gjfz.透明找图("赵元宝坐标","赵元宝坐标",626,0,734,252,0,0.7)
        if (zyb1) {
            sleep(150);
            clickPoint(485,44)
            sleep("2500")
            clickPoint(421,665)

            break;
        }
        else {
            iooi++
            if (iooi===430){
                return;
            }
        }
        }
    sleep("200")
    let ixx = 0 ;
    while (true) {
        let 白色旗 = ocrjq.烹饪()
        if (白色旗) {
            break;
        } else {
            sleep(300)
            ixx++;
            let 重叠判断 = gjfz.透明找图("请选择一个角色","请选择一个角色",22,507,582,1097,0,0.7)
            if (重叠判断) {
                logd("请选择要做的事");
                sleep("100")
                gjfz.dzbs("#FBFBFB-#101010","2|-12|#FDFDFF-#101010,23|-93|#385867-#101010,-33|-101|#30505F-#101010,-29|127|#30505F-#101010,33|138|#385867-#101010,5|53|#415D72-#101010,-9|52|#30546A-#101010,-10|43|#315669-#101010,-2|42|#345568-#101010,-8|29|#305568-#101010,-2|22|#355466-#101010,-5|22|#2F5568-#101010,5|22|#385469-#101010,-7|9|#305568-#101010,-8|-1|#30546A-#101010,0|-5|#385469-#101010,-1|6|#385469-#101010,-4|-9|#FEFEFE-#101010,-10|-12|#FCFEFD-#101010,-7|-16|#F7F7F7-#101010,7|-12|#FDFDFD-#101010,-1|0|#FEFEFE-#101010,1|-4|#385469-#101010,-1|-9|#3B566B-#101010,0|-14|#53697E-#101010")
                sleep("500")
            }else {
                if (ixx===3){
                    clickPoint(411,660)
                }
            }
            if (ixx === 5){
                sleep("200")
                clickPoint(463,1190)
                sleep("500")
                clickPoint(596,900)
                sleep("3000")
                clickPoint(411,660)
                sleep("500")
            }
            if (ixx===8){
                return;
            }

        }
    }


    let iix = 0 ;
    while (true) {
        let 给予界面 =  gjfz.透明找图("给予确定", "给予确定", 6,223,141,571, 1, 0.7)
        if (给予界面) {
            return;
        } else {
            sleep("500")
            iix++;
            if (iix===3){
                clickPoint(446,700)
                sleep("800")
                let 白色旗 = gjfz.透明找图("请选择要做的事", "请选择要做的事", 3, 853, 746, 1326, 0, 0.8)
                if (白色旗) {
                  ocrjq.烹饪()
                    sleep("500")
                    gjfz.透明找图("给予确定", "给予确定", 6,223,141,571, 1, 0.7)
                    return;
                }
            }
            if (iix === 5) {
                sleep("500")
                clickPoint(463,1190)
                sleep("500")
                clickPoint(596,900)
                sleep("3000")
                clickPoint(446,700)
                sleep("500")
                let 白色旗 = gjfz.透明找图("请选择要做的事", "请选择要做的事", 3, 853, 746, 1326, 0, 0.8)
                if (白色旗) {
                  ocrjq.烹饪()
                    sleep("500")
                    gjfz.透明找图("给予确定", "给予确定", 6,223,141,571, 1, 0.7)
                    return;
                }
            }
            if (iix===8){
                return;
            }
        }
    }

}
//建邺，飞行符

Csh_function.prototype.地遁鬼=function() {

    doubleClickPoint(150,1166)
    sleep("300")
    let 循环 =0;
    while (true){
        let zyb1 = gjfz.透明找图("地遁鬼判断","地遁鬼判断",x,y,x1,y1,0,0.7)
        if (zyb1) {
            sleep("500")
            clickPoint(512,1172)
            sleep("500")
            clickPoint(580,904)
            break;
        }
        else {
            sleep(200);
            doubleClickPoint(150,1166)
            循环++
            if (循环 === 3){
                sleep("2000")
                clickPoint(722,1294)
                sleep("2000")
                clickPoint(635,1045)
                sleep("2000")
                clickPoint(722,1294)
                sleep("2000")
                clickPoint(632,1230)
                sleep("300")
                doubleClickPoint(150,1166)
            }
            if (循环 === 5){
                sleep("2000")
                clickPoint(722,1294)
                sleep("2000")
                clickPoint(635,1045)
                sleep("2000")
                clickPoint(722,1294)
                sleep("2000")
                clickPoint(632,1230)
                sleep("300")
                doubleClickPoint(150,1166)
            }
        }}

let iooi = 0
    while (true){
        let zyb1 = gjfz.透明找图("ddgzb","地遁鬼坐标",x,y,x1,y1,0,0.7)
        if (zyb1) {
            sleep("3000")
            clickPoint(405,661)
            break;
        }
        else {
            iooi++
            if (iooi===150){
                return;
            }
        }
    }
    sleep("200")

    let ixx = 0 ;
    while (true) {
        let 白色旗 = ocrjq.烹饪()
        if (白色旗) {
            break;
        } else {
            ixx++;
            let 重叠判断 = gjfz.透明找图("请选择一个角色","请选择一个角色",22,507,582,1097,0,0.7)
            if (重叠判断) {
                logd("请选择要做的事");
                sleep("100")
                gjfz.透明找图("地遁鬼重叠","地遁鬼重叠",137,557,488,998,1,0.7)
                //gjfz.dzbs("#FBFBFB-#101010","2|-12|#FDFDFF-#101010,23|-93|#385867-#101010,-33|-101|#30505F-#101010,-29|127|#30505F-#101010,33|138|#385867-#101010,5|53|#415D72-#101010,-9|52|#30546A-#101010,-10|43|#315669-#101010,-2|42|#345568-#101010,-8|29|#305568-#101010,-2|22|#355466-#101010,-5|22|#2F5568-#101010,5|22|#385469-#101010,-7|9|#305568-#101010,-8|-1|#30546A-#101010,0|-5|#385469-#101010,-1|6|#385469-#101010,-4|-9|#FEFEFE-#101010,-10|-12|#FCFEFD-#101010,-7|-16|#F7F7F7-#101010,7|-12|#FDFDFD-#101010,-1|0|#FEFEFE-#101010,1|-4|#385469-#101010,-1|-9|#3B566B-#101010,0|-14|#53697E-#101010")
                sleep("500")
            }else {
                if (ixx===3){
                    clickPoint(414,664)
                }
            }
            if (ixx === 5){
                sleep("200")
                clickPoint(463,1190)
                sleep("500")
                clickPoint(596,900)
                sleep("3000")
                clickPoint(414,664)
                sleep("500")
            }
            if (ixx===8){
                return;
            }

        }
    }


    let iix = 0 ;
    while (true) {
        let 给予界面 =  gjfz.透明找图("给予确定", "给予确定", 6,223,141,571, 1, 0.7)
        if (给予界面) {
            return;
        } else {
            sleep("500")
            iix++;
            if (iix===3){
                clickPoint(414,664)
                sleep("800")
                let 白色旗 = gjfz.透明找图("请选择要做的事", "请选择要做的事", 3, 853, 746, 1326, 0, 0.8)
                if (白色旗) {
                  ocrjq.烹饪()
                    sleep("500")
                    gjfz.透明找图("给予确定", "给予确定", 6,223,141,571, 1, 0.7)
                    return;
                }
            }
            if (iix === 5) {
                sleep("500")
                clickPoint(463,1190)
                sleep("500")
                clickPoint(596,900)
                sleep("3000")
                clickPoint(414,664)
                sleep("500")
                let 白色旗 = gjfz.透明找图("请选择要做的事", "请选择要做的事", 3, 853, 746, 1326, 0, 0.8)
                if (白色旗) {
                  ocrjq.烹饪()
                    sleep("500")
                    gjfz.透明找图("给予确定", "给予确定", 6,223,141,571, 1, 0.7)
                    return;
                }
            }
            if (iix===8){
                return;
            }
        }
    }

}
// 第二个技能

Csh_function.prototype.怜儿姑娘=function() {

    ocrjq.红色旗子()
    let 循环 = 0
    while (true){
        let 怜儿姑娘坐标 = gjfz.透明找图("玲儿姑娘坐标","怜儿姑娘坐标",590,24,729,288,0,0.7)
        if (怜儿姑娘坐标){
            sleep("300")
            clickPoint(452,784)
            break;
        }else {
            循环++
            if (循环===3){
                sleep("300")
                doubleClickPoint(290,657)
                sleep("500")
                clickPoint(690,1110)
            }
            if (循环===40){
                return;
            }
        }
    }


    let ixx = 0 ;
    while (true) {
        let 白色旗 = ocrjq.烹饪()
        if (白色旗) {
            break;
        } else {
            ixx++;
            let 重叠判断 = gjfz.透明找图("请选择一个角色","请选择一个角色",22,507,582,1097,0,0.7)
            if (重叠判断) {
                logd("请选择要做的事");
                sleep("100")
                gjfz.dzbs("#FBFBFB-#101010","2|-12|#FDFDFF-#101010,23|-93|#385867-#101010,-33|-101|#30505F-#101010,-29|127|#30505F-#101010,33|138|#385867-#101010,5|53|#415D72-#101010,-9|52|#30546A-#101010,-10|43|#315669-#101010,-2|42|#345568-#101010,-8|29|#305568-#101010,-2|22|#355466-#101010,-5|22|#2F5568-#101010,5|22|#385469-#101010,-7|9|#305568-#101010,-8|-1|#30546A-#101010,0|-5|#385469-#101010,-1|6|#385469-#101010,-4|-9|#FEFEFE-#101010,-10|-12|#FCFEFD-#101010,-7|-16|#F7F7F7-#101010,7|-12|#FDFDFD-#101010,-1|0|#FEFEFE-#101010,1|-4|#385469-#101010,-1|-9|#3B566B-#101010,0|-14|#53697E-#101010")
                sleep("500")
            }else {
                if (ixx===3){
                    clickPoint(452,784)
                }
            }
            if (ixx === 5){
                sleep("200")
                clickPoint(463,1190)
                sleep("500")
                clickPoint(596,900)
                sleep("3000")
                clickPoint(452,784)
                sleep("500")
            }
            if (ixx===8){
                return;
            }

        }
    }


    let iix = 0 ;
    while (true) {
        let 给予界面 =  gjfz.透明找图("给予确定", "给予确定", 6,223,141,571, 1, 0.7)
        if (给予界面) {
            return;
        } else {
            sleep("500")
            iix++;
            if (iix===3){
                clickPoint(452,784)
                sleep("800")
                let 白色旗 = gjfz.透明找图("请选择要做的事", "请选择要做的事", 3, 853, 746, 1326, 0, 0.8)
                if (白色旗) {
                   ocrjq.烹饪()
                    sleep("500")
                    gjfz.透明找图("给予确定", "给予确定", 6,223,141,571, 1, 0.7)
                    return;
                }
            }
            if (iix === 5) {
                sleep("500")
                clickPoint(463,1190)
                sleep("500")
                clickPoint(596,900)
                sleep("3000")
                clickPoint(452,784)
                sleep("500")
                let 白色旗 = gjfz.透明找图("请选择要做的事", "请选择要做的事", 3, 853, 746, 1326, 0, 0.8)
                if (白色旗) {
                  ocrjq.烹饪()
                    sleep("500")
                    gjfz.透明找图("给予确定", "给予确定", 6,223,141,571, 1, 0.7)
                    return;
                }
            }
            if (iix===8){
                return;
            }
        }
    }
}
//红色旗子，长安城
// var 循环 = 0 ;


Csh_function.prototype.蛇蝎美人=function(){
    ocrjq.打开道具()
    let sxmr = gjfz.图片查找("蛇蝎美人", 163, 576, 599, 1136)
    if (sxmr) {
        clickPoint(685,1120)
        sleep("300")
        // clickPoint(466,1188)
        // sleep(300);
    }else {
        clickPoint(595,907)
        //打开行囊
        sleep("300")
        let sxmr1 = gjfz.图片查找("蛇蝎美人", 163, 576, 599, 1136)
        if (sxmr1) {
            logd("找到");
            gjfz.图片查找("蛇蝎美人", 163, 576, 599, 1136,2)
            sleep("300")
            //点击道具
            clickPoint(595,730)
            sleep("300")
            clickPoint(687,1120)
            sleep("300")
            // clickPoint(472,1190)
            // sleep(300);
        }else {
            ocrjq.白色旗仓库管理员()
            ocrjq.仓库管理员()
            clickPoint(490,597)
            sleep("1000")

    let sxmr2 = gjfz.图片查找("蛇蝎美人", 130, 112, 570, 650)
    if (sxmr2) {
        logd("找到");
        let 蛇蝎美人1 = gjfz.图片查找("蛇蝎美人", 130, 112, 570, 650,2)
        if (蛇蝎美人1){
            logd("蛇蝎美人")
        }else {
            sleep(800)
            gjfz.图片查找("蛇蝎美人", 130, 112, 570, 650,2)
        }
        sleep("500")
        clickPoint(600, 902)
        sleep("500")
        let 蛇蝎美人2 = gjfz.图片查找("蛇蝎美人", 130, 112, 570, 650,2)
        if (蛇蝎美人2){
            logd("蛇蝎美人")
        }else {
            sleep(800)
           let 判断 = gjfz.图片查找("蛇蝎美人", 130, 112, 570, 650,2)
            if (判断){
                logd("蛇蝎美人")
            }else {
                logd("第一页没有蛇蝎美人")
                sleep(100)
                clickPoint(100, 377)
            }
        }
        sleep("300")
        clickPoint(692, 1117)
        sleep("300")
        // clickPoint(467, 1175)
        // sleep(300);

    } else {
        sleep(300)
        clickPoint(100, 377)
        sleep("500")

        logd("找到");
        let 蛇蝎美人 = gjfz.图片查找("蛇蝎美人", 130, 112, 570, 650,2)
        if (蛇蝎美人){
            logd("蛇蝎美人")
        }else {
            sleep(800)
            gjfz.图片查找("蛇蝎美人", 130, 112, 570, 650,2)
        }
        sleep("500")
        clickPoint(600, 902)
        sleep("500")
        let 蛇蝎美人3 = gjfz.图片查找("蛇蝎美人", 130, 112, 570, 650,2)
        if (蛇蝎美人3){
            logd("蛇蝎美人")
        }else {
            sleep(800)
            gjfz.图片查找("蛇蝎美人", 130, 112, 570, 650,2)
        }
        sleep("300")
        clickPoint(692, 1117)
        sleep("300")
        // clickPoint(467, 1175)
        // sleep(300);

    }
    }
    }

}

Csh_function.prototype.红雪散=function(){
    ocrjq.打开道具()
    let sxmr = gjfz.图片查找("红雪散", 163, 576, 599, 1136)
    if (sxmr) {
        //找到直接关闭
        clickPoint(685,1120)
        sleep("300")
        // clickPoint(466,1188)
        // sleep(300);
    }else {
        clickPoint(595,907)
        //打开行囊
        sleep("500")
        let sxmr1 = gjfz.图片查找("红雪散", 163, 576, 599, 1136)
        if (sxmr1) {
            logd("找到");
            gjfz.图片查找("红雪散", 163, 576, 599, 1136,2)
            sleep("500")
            //点击道具
            clickPoint(595,730)
            sleep("300")
            //关闭
            clickPoint(687,1120)
            sleep("300")
            //点击烹饪任务向导
            // clickPoint(472,1190)
            // sleep(300);
        }else {
            ocrjq.白色旗仓库管理员()
            ocrjq.仓库管理员()
            //点击行数
            //第十二行
            clickPoint(390,302)
            sleep("1000")

                let sxmr2 = gjfz.图片查找("红雪散", 130, 112, 570, 650)
                if (sxmr2) {
                    logd("找到");
                    let 红雪散2 = gjfz.图片查找("红雪散", 130, 112, 570, 650,2)
                    if (红雪散2){
                        logd("红雪散")
                    }else {
                        sleep(800)
                        gjfz.图片查找("红雪散", 130, 112, 570, 650,2)
                    }
                    sleep("500")
                    clickPoint(600, 902)
                    sleep("500")
                    let 红雪散3 = gjfz.图片查找("红雪散", 130, 112, 570, 650,2)
                    if (红雪散3){
                        logd("红雪散")
                    }else {
                        sleep(800)
                        let 判断 = gjfz.图片查找("红雪散", 130, 112, 570, 650,2)
                        if (判断){
                            logd("红雪散")
                        }else {
                            logd("第一页没有红雪散")
                            sleep(100)
                            clickPoint(100, 377)
                        }
                    }
                    sleep("300")
                    clickPoint(692, 1117)
                    sleep("300")
                    // clickPoint(467, 1175)
                    // sleep(300);
                } else {
                    sleep("300")
                    clickPoint(100, 377)
                    sleep("500")
                    let 红雪散 = gjfz.图片查找("红雪散", 130, 112, 570, 650,2)
                    if (红雪散){
                        logd("红雪散")
                    }else {
                        sleep(800)
                        gjfz.图片查找("红雪散", 130, 112, 570, 650,2)
                    }
                    sleep("500")
                    clickPoint(600,902)
                    sleep("500")
                    let 红雪散1 = gjfz.图片查找("红雪散", 130, 112, 570, 650,2)
                    if (红雪散1){
                        logd("红雪散")
                    }else {
                        sleep(800)
                        gjfz.图片查找("红雪散", 130, 112, 570, 650,2)
                    }
                    sleep("300")
                    clickPoint(692, 1117)
                    sleep("300")
                    // clickPoint(467, 1175)
                    // sleep(300);
                }
            }
        }


}

Csh_function.prototype.十香返生丸=function(){
    ocrjq.打开道具()
    let sxmr = gjfz.图片查找("十香返生丸", 163, 576, 599, 1136)
    if (sxmr) {
        //找到直接关闭
        clickPoint(685,1120)
        sleep("300")
        // clickPoint(466,1188)
        // sleep(300);

    }else {
        clickPoint(595,907)
        //打开行囊
        sleep("500")
        let sxmr1 = gjfz.图片查找("十香返生丸", 163, 576, 599, 1136)
        if (sxmr1) {
            logd("找到");
            gjfz.图片查找("十香返生丸", 163, 576, 599, 1136,2)
            sleep("500")
            //点击道具
            clickPoint(595,730)
            sleep("300")
            //关闭
            clickPoint(687,1120)
            sleep("300")
            //点击烹饪任务向导
            // clickPoint(472,1190)
            // sleep(300);
        }else {
            ocrjq.白色旗仓库管理员()
            ocrjq.仓库管理员()
            //点击行数
            //第六行
            clickPoint(488, 210)
            sleep("1000")

    let sxmr3 = gjfz.图片查找("十香返生丸", 130, 112, 570, 650)
    if (sxmr3) {
        logd("找到");
        let 十香返生丸 = gjfz.图片查找("十香返生丸", 130, 112, 570, 650,2)
        if (十香返生丸){
            logd("十香返生丸")
        }else {
            sleep(800)
            let 判断 = gjfz.图片查找(十香返生丸, 130, 112, 570, 650,2)
            if (判断){
                logd("十香返生丸")
            }else {
                logd("第一页没有十香返生丸")
                sleep(100)
                clickPoint(100, 377)
            }
        }
        sleep("500")
        clickPoint(600, 902)
        sleep("500")
        let 十香返生丸1 = gjfz.图片查找("十香返生丸", 130, 112, 570, 650,2)
        if (十香返生丸1){
            logd("十香返生丸")
        }else {
            sleep(800)
            gjfz.图片查找(十香返生丸, 130, 112, 570, 650,2)
        }
        sleep("300")
        clickPoint(692, 1117)
        sleep("300")
        // clickPoint(467, 1175)
        // sleep(300);
    } else {
        sleep(300)
        clickPoint(100, 377)
        sleep(500)
        let 十香返生丸1 = gjfz.图片查找("十香返生丸", 130, 112, 570, 650,2)
        if (十香返生丸1){
            logd("十香返生丸")
        }else {
            sleep(800)
            gjfz.图片查找("十香返生丸", 130, 112, 570, 650,2)
        }
        sleep("500")
        clickPoint(600,902)
        sleep("500")
        let 十香返生丸2 = gjfz.图片查找("十香返生丸", 130, 112, 570, 650,2)
        if (十香返生丸2){
            logd("十香返生丸")
        }else {
            sleep(800)
            gjfz.图片查找("十香返生丸", 130, 112, 570, 650,2)
        }
        sleep("300")
        clickPoint(692, 1117)
        sleep("300")
        // clickPoint(467, 1175)
        // sleep(300);
    }
}
        }



}

Csh_function.prototype.定神香=function(){
    ocrjq.打开道具()
    let sxmr = gjfz.图片查找("定神香", 163, 576, 599, 1136)
    if (sxmr) {
        //找到直接关闭
        clickPoint(685,1120)
        sleep("300")
        // clickPoint(466,1188)
        // sleep(300);
    }else {
        clickPoint(595,907)
        //打开行囊
        sleep("500")
        let sxmr1 = gjfz.图片查找("定神香", 163, 576, 599, 1136)
        if (sxmr1) {
            logd("找到");
            gjfz.图片查找("定神香", 163, 576, 599, 1136,2)
            sleep("500")
            //点击道具
            clickPoint(595,730)
            sleep("300")
            //关闭
            clickPoint(687,1120)
            sleep("300")
            //点击烹饪任务向导
            // clickPoint(472,1190)
            // sleep(300);
        }else {
            ocrjq.白色旗仓库管理员()
            ocrjq.仓库管理员()
            //点击行数
            //第四行
            clickPoint(586,496)
            sleep("1000")

                let sxmr2 = gjfz.图片查找("定神香", 130, 112, 570, 650)
                if (sxmr2) {
                    logd("找到");
                    let 定神香3 = gjfz.图片查找("定神香", 130, 112, 570, 650,2)
                    if (定神香3){
                        logd("定神香")
                    }else {
                        sleep(800)
                        gjfz.图片查找("定神香", 130, 112, 570, 650,2)
                    }
                    sleep("500")
                    clickPoint(600, 902)
                    sleep("500")
                    let 定神香2 = gjfz.图片查找("定神香", 130, 112, 570, 650,2)
                    if (定神香2){
                        logd("定神香")
                    }else {
                        sleep(800)
                        let 判断 = gjfz.图片查找("定神香", 130, 112, 570, 650,2)
                        if (判断){
                            logd("定神香")
                        }else{
                            logd("第一页没有定神香")
                            sleep(100)
                            clickPoint(100, 377)
                        }
                    }
                    sleep("300")
                    clickPoint(692, 1117)
                    sleep("300")
                    // clickPoint(467, 1175)
                    // sleep(300);
                } else {
                    sleep(300)
                    clickPoint(100, 377)
                    sleep("500")
                    let 定神香 = gjfz.图片查找("定神香", 130, 112, 570, 650,2)
                    if (定神香){
                        logd("定神香")
                    }else {
                        sleep(800)
                        gjfz.图片查找("定神香", 130, 112, 570, 650,2)
                    }
                    sleep("500")
                    clickPoint(600,902)
                    sleep("500")
                    let 定神香1 = gjfz.图片查找("定神香", 130, 112, 570, 650,2)
                    if (定神香1){
                        logd("定神香")
                    }else {
                        sleep(800)
                        gjfz.图片查找("定神香", 130, 112, 570, 650,2)
                    }
                    sleep("300")
                    clickPoint(692, 1117)
                    sleep("300")
                    // clickPoint(467, 1175)
                    // sleep(300);
                }
            }
        }
}

Csh_function.prototype.五龙丹=function(){
    ocrjq.打开道具()
    let sxmr =  gjfz.图片查找("五龙丹", 163, 576, 599, 1136)
    if (sxmr) {
        //找到直接关闭
        clickPoint(685,1120)
        sleep("300")
        // clickPoint(466,1188)
        // sleep(300);
    }else {
        clickPoint(595,907)
        //打开行囊
        sleep("500")

        let sxmr1 = gjfz.图片查找("五龙丹", 163, 576, 599, 1136)
        if (sxmr1) {
            logd("找到");
            gjfz.图片查找("五龙丹", 163, 576, 599, 1136,2)
            sleep("500")
            //点击道具
            clickPoint(595,730)
            sleep("300")
            //关闭
            clickPoint(687,1120)
            sleep("300")
            //点击烹饪任务向导
            // clickPoint(466,1188)
            // sleep(300);
        }else {
            ocrjq.白色旗仓库管理员()
            ocrjq.仓库管理员()
            //点击行数
            //第十四行
            clickPoint(388,498)
            sleep("1000")

                let sxmr2 = gjfz.图片查找("五龙丹", 130, 112, 570, 650)
                if (sxmr2) {
                    logd("找到");
                    let 五龙丹2 = gjfz.图片查找("五龙丹", 130, 112, 570, 650,2)
                    if (五龙丹2){
                        logd("五龙丹")
                    }else {
                        sleep(800)
                        gjfz.图片查找("五龙丹", 130, 112, 570, 650,2)
                    }
                    sleep("500")
                    clickPoint(600, 902)
                    sleep("500")
                    let 五龙丹3 = gjfz.图片查找("五龙丹", 130, 112, 570, 650,2)
                    if (五龙丹3){
                        logd("五龙丹")
                    }else {
                        sleep(800)
                       let 判断 =  gjfz.图片查找("五龙丹", 130, 112, 570, 650,2)
                        if (判断){
                            logd("五龙丹")
                        }else {
                            logd("第一页没有五龙丹")
                            sleep(100)
                            clickPoint(100, 377)
                        }
                    }
                    sleep("300")
                    clickPoint(692, 1117)
                    sleep("300")
                    // clickPoint(467, 1175)
                    // sleep("300")
                } else {
                    sleep(300)
                    clickPoint(100, 377)
                    sleep("500")
                    let 五龙丹 = gjfz.图片查找("五龙丹", 130, 112, 570, 650,2)
                    if (五龙丹){
                        logd("五龙丹")
                    }else {
                        sleep(800)
                        gjfz.图片查找("五龙丹", 130, 112, 570, 650,2)
                    }
                    sleep("500")
                    clickPoint(600,902)
                    sleep("500")
                    let 五龙丹1 = gjfz.图片查找("五龙丹", 130, 112, 570, 650,2)
                    if (五龙丹1){
                        logd("五龙丹")
                    }else {
                        sleep(800)
                        gjfz.图片查找("五龙丹", 130, 112, 570, 650,2)
                    }
                    sleep("300")
                    clickPoint(692, 1117)
                    sleep("300")
                    // clickPoint(467, 1175)
                    // sleep("300")
                }


            }
        }

}

Csh_function.prototype.风水混元丹=function(){
    ocrjq.打开道具()
    let sxmr = gjfz.透明找图("风水混元丹","风水混元丹", 163, 576, 599, 1136,0,0.7)
    if (sxmr) {
        //找到直接关闭
        clickPoint(685,1120)
        sleep("300")
        // clickPoint(466,1188)
        // sleep("300")
    }else {
        clickPoint(595,907)
        //打开行囊
        sleep("500")
        let sxmr1 = gjfz.图片查找("风水混元丹", 163, 576, 599, 1136)
        if (sxmr1) {
            logd("找到");
            gjfz.图片查找("风水混元丹", 163, 576, 599, 1136,2)
            sleep("500")
            //点击道具
            clickPoint(595,730)
            sleep("300")
            //关闭
            clickPoint(687,1120)
            sleep("300")
            //点击烹饪任务向导
            // clickPoint(472,1190)
            // sleep("300")
        }else {
            ocrjq.白色旗仓库管理员()
            ocrjq.仓库管理员()
            //点击行数
            //第二行
            sleep(100)
            clickPoint(100, 377)
            sleep(300)
            clickPoint(100, 377)
            sleep("1000")

                let sxmr2 = gjfz.图片查找("风水混元丹", 130, 112, 570, 650)
                if (sxmr2) {
                    logd("找到");

                    let 风水混元丹3 = gjfz.图片查找("风水混元丹", 130, 112, 570, 650,2)
                    if (风水混元丹3){
                        logd("风水混元丹")
                    }else {
                        sleep(800)
                        gjfz.图片查找("风水混元丹", 130, 112, 570, 650,2)
                    }
                    sleep("500")
                    clickPoint(600, 902)
                    sleep("500")
                    let 风水混元丹2 = gjfz.图片查找("风水混元丹", 130, 112, 570, 650,2)
                    if (风水混元丹2){
                        logd("风水混元丹")
                    }else {
                        sleep(800)
                       let 判断 = gjfz.图片查找("风水混元丹", 130, 112, 570, 650,2)
                        if(判断){
                            logd("风水混元丹")
                        }else{
                            logd("第一页没有风水混元丹")
                            sleep(100)
                            clickPoint(100, 377)
                        }
                    }
                    sleep("300")
                    clickPoint(692, 1117)
                    // sleep("300")
                    // clickPoint(467, 1175)

                } else {
                    sleep(300)
                    clickPoint(100, 377)
                    sleep("500")
                    let 风水混元丹 = gjfz.图片查找("风水混元丹", 130, 112, 570, 650,2)
                    if (风水混元丹){
                        logd("风水混元丹")
                    }else {
                        sleep(800)
                        gjfz.图片查找("风水混元丹", 130, 112, 570, 650,2)
                    }
                    sleep("500")
                    clickPoint(600,902)
                    sleep("500")
                    let 风水混元丹1 = gjfz.图片查找("风水混元丹", 130, 112, 570, 650,2)
                    if (风水混元丹1){
                        logd("风水混元丹")
                    }else {
                        sleep(800)
                        gjfz.图片查找("风水混元丹", 130, 112, 570, 650,2)
                    }
                    sleep("300")
                    clickPoint(692, 1117)
                    sleep("300")
                    // clickPoint(467, 1175)
                    // sleep("300")
                }
            }
        }


}

Csh_function.prototype.佛光舍利子=function(){
    ocrjq.打开道具()
    let sxmr = gjfz.图片查找("佛光舍利子", 163, 576, 599, 1136)
    if (sxmr) {
        sleep(100);
        clickPoint(692,1114)
        sleep("300")
        // clickPoint(466,1188)
        // sleep(300);

    }else {
        clickPoint(595,907)
        //打开行囊
        sleep("500")
        let sxmr1 = gjfz.图片查找("佛光舍利子", 163, 576, 599, 1136)
        if (sxmr1) {
            logd("找到");
            gjfz.图片查找("佛光舍利子", 163, 576, 599, 1136,2)
            sleep("500")
            //点击道具
            clickPoint(595,730)
            sleep("300")
            //关闭
            clickPoint(687,1120)
            sleep("300")
            //点击烹饪任务向导
            // clickPoint(472,1190)
            // sleep("300")
        }else {
            ocrjq.白色旗仓库管理员()
            ocrjq.仓库管理员()
            //点击行数
            //第八行
            clickPoint(488,404)
            sleep("1000")

                let sxmr2 = gjfz.图片查找("佛光舍利子", 130, 112, 570, 650)
                if (sxmr2) {
                    logd("找到");

                    let 佛光舍利子2 = gjfz.图片查找("佛光舍利子", 130, 112, 570, 650,2)
                    if (佛光舍利子2){
                        logd("佛光舍利子")
                    }else {
                        sleep(800)
                        let 判断 = gjfz.图片查找("佛光舍利子", 130, 112, 570, 650,2)
                        if (判断){
                            logd("佛光舍利子")
                        }else {
                            logd("第一页没有佛光舍利子")
                            sleep(100)
                            clickPoint(100, 377)
                        }
                    }
                    sleep("500")
                    clickPoint(600, 902)
                    sleep("500")
                    let 佛光舍利子3 = gjfz.图片查找("佛光舍利子", 130, 112, 570, 650,2)
                    if (佛光舍利子3){
                        logd("佛光舍利子")
                    }else {
                        sleep(800)
                        gjfz.图片查找("佛光舍利子", 130, 112, 570, 650,2)
                    }
                    sleep("300")
                    clickPoint(692, 1117)
                    sleep("300")
                    // clickPoint(467, 1175)
                    // sleep("300")
                } else {
                    sleep(300)
                    clickPoint(100, 377)
                    let 佛光舍利子 = gjfz.图片查找("佛光舍利子", 130, 112, 570, 650,2)
                    if (佛光舍利子){
                        logd("佛光舍利子")
                    }else {
                        sleep(800)
                        gjfz.图片查找("佛光舍利子", 130, 112, 570, 650,2)
                    }
                    sleep("500")
                    clickPoint(600,902)
                    sleep("500")
                    let 佛光舍利子1 = gjfz.图片查找("佛光舍利子", 130, 112, 570, 650,2)
                    if (佛光舍利子1){
                        logd("佛光舍利子")
                    }else {
                        sleep(800)
                        gjfz.图片查找("佛光舍利子", 130, 112, 570, 650,2)
                    }
                    sleep("300")
                    clickPoint(692, 1117)
                    // sleep("300")
                    // clickPoint(467, 1175)

                }
            }
        }



}

Csh_function.prototype.金创药=function(){
    ocrjq.打开道具()
    let sxmr = gjfz.图片查找("金创药", 163, 576, 599, 1136)
    if (sxmr) {
        clickPoint(685,1120)
        sleep("300")
        // clickPoint(466,1188)
        // sleep("300")
    }else {
        clickPoint(595,907)
        //打开行囊
        sleep("500")
        let sxmr1 = gjfz.图片查找("金创药", 163, 576, 599, 1136)
        if (sxmr1) {
            logd("找到");
            gjfz.图片查找("金创药", 163, 576, 599, 1136,2)
            sleep("500")
            //点击道具
            clickPoint(595,730)
            sleep("300")
            //关闭
            clickPoint(687,1120)
            sleep("300")
            //点击烹饪任务向导
            // clickPoint(472,1190)
            // sleep("300")
        }else {
            ocrjq.白色旗仓库管理员()
            ocrjq.仓库识别()
            sleep("1000")
            while (true){
                let sxmr2 =  gjfz.图片查找("金创药", 130, 112, 570, 650)
                if (sxmr2) {
                    logd("找到");

                    gjfz.图片查找("金创药", 130, 112, 570, 650,2)
                    sleep("300")
                    clickPoint(692, 1117)
                    sleep("300")
                    // clickPoint(467, 1175)
                    // sleep("300")
                    return;
                }else {
                    sleep("500")
                }
            }
        }

    }

}

Csh_function.prototype.血色茶花白色旗子=function(){
    var x = device.getDeviceAlias();
    logd(x);
    sleep("200")
  let 读取 = file.readLine("C:/1/"+x+".txt",1);
  if (读取 == JSON.stringify(240) || 读取 === JSON.stringify(480) || 读取 == JSON.stringify(720)  || 读取 == JSON.stringify(960) || 读取 == JSON.stringify(1200) || 读取 == JSON.stringify(1440) || 读取 == JSON.stringify(1680) || 读取 == JSON.stringify(1920) || 读取 == JSON.stringify(2160) || 读取 == JSON.stringify(2400) || 读取 == JSON.stringify(2640) || 读取 == JSON.stringify(2880) || 读取 == JSON.stringify(3120) || 读取 == JSON.stringify(3360) || 读取 === JSON.stringify(3600) || 读取 === JSON.stringify(3840) || 读取 === JSON.stringify(4080) || 读取 === JSON.stringify(4320)|| 读取 === JSON.stringify(4560)|| 读取 === JSON.stringify(4800)|| 读取 === JSON.stringify(5040)|| 读取 === JSON.stringify(5280)|| 读取 === JSON.stringify(5520)|| 读取 === JSON.stringify(5760)) {
      ocrjq.打开道具()
      sleep(500);
      let iuo = 0 ;
      while (true) {
          let 血色茶花 = gjfz.血色茶花("白旗子", 163, 576, 599, 1136)
          if (血色茶花) {
              logd("血色茶花")
              break
          } else {
              iuo++
              sleep("500")
              if (iuo===8){
                  logw("没找到血色茶花请手动")
                  return
              }
          }
      }
  }
}